{"meta":{"title":"Rovinty 放牛场","subtitle":"点点滴滴，记录生活","description":"唯天下之至诚能胜天下之至伪;唯天下之至拙能胜天下之至巧.","author":"Devin","url":"http://lolee.cn"},"pages":[],"posts":[{"title":"基于RBAC权限管理","slug":"基于RBAC权限管理","date":"2017-08-29T11:31:18.000Z","updated":"2019-04-29T10:42:16.293Z","comments":true,"path":"2017/08/29/基于RBAC权限管理/","link":"","permalink":"http://lolee.cn/2017/08/29/基于RBAC权限管理/","excerpt":"1 RBAC模型 访问控制是针对越权使用资源的防御措施。基本目标是为了限制访问主体（用户、进程、服务等）对访问客体（文件、系统等）的访问权限，从而使计算机系统在合法范围内使用；决定用户能做什么，也决定代表一定用户利益的程序能做什么 。","text":"1 RBAC模型 访问控制是针对越权使用资源的防御措施。基本目标是为了限制访问主体（用户、进程、服务等）对访问客体（文件、系统等）的访问权限，从而使计算机系统在合法范围内使用；决定用户能做什么，也决定代表一定用户利益的程序能做什么 。 企业环境中的访问控制策略一般有三种：自主型访问控制方法、强制型访问控制方法和基于角色的访问控制方法（RBAC）。其中，自主式太弱，强制式太强，二者工作量大，不便于管理[1]。基于角色的访问控制方法是目前公认的解决大型企业的统一资源访问控制的有效方法。其显著的两大特征是：1.减小授权管理的复杂性，降低管理开销；2.灵活地支持企业的安全策略，并对企业的变化有很大的伸缩性。 NIST（The National Institute of Standards and Technology，美国国家标准与技术研究院）标准RBAC模型由4个部件模型组成，这4个部件模型分别是基本模型RBAC0（Core RBAC）、角色分级模型RBAC1（Hierarchal RBAC）、角色限制模型RBAC2（Constraint RBAC）和统一模型RBAC3（Combines RBAC）[1]。RBAC0模型如图1所示。 a. RBAC 0定义了能构成一个RBAC控制系统的最小的元素集合。在RBAC之中,包含用户users(USERS)、角色roles(ROLES)、目标objects(OBS)、操作operations(OPS)、许可权permissions(PRMS)五个基本数据元素，权限被赋予角色,而不是用户，当一个角色被指定给一个用户时，此用户就拥有了该角色所包含的权限。会话sessions是用户与激活的角色集合之间的映射。RBAC0与传统访问控制的差别在于增加一层间接性带来了灵活性，RBAC1、RBAC2、RBAC3都是先后在RBAC0上的扩展。 b. RBAC 1引入角色间的继承关系，角色间的继承关系可分为一般继承关系和受限继承关系。一般继承关系仅要求角色继承关系是一个绝对偏序关系，允许角色间的多继承。而受限继承关系则进一步要求角色继承关系是一个树结构。 c. RBAC 2模型中添加了责任分离关系。RBAC2的约束规定了权限被赋予角色时,或角色被赋予用户时,以及当用户在某一时刻激活一个角色时所应遵循的强制性规则。责任分离包括静态责任分离和动态责任分离。约束与用户-角色-权限关系一起决定了RBAC2模型中用户的访问许可。 d. RBAC 3包含了RBAC1和RBAC2，既提供了角色间的继承关系，又提供了责任分离关系。 2 核心对象模型设计根据RBAC模型的权限设计思想，建立权限管理系统的核心对象模型.对象模型中包含的基本元素主要有：用户（Users）、用户组（Group）、角色（Role）、目标（Objects）、访问模式（Access Mode）、操作（Operator）。主要的关系有：分配角色权限PA（Permission Assignment）、分配用户角色UA（Users Assignmen描述如下： a .控制对象：是系统所要保护的资源（Resource），可以被访问的对象。资源的定义需要注意以下两个问题： 1.资源具有层次关系和包含关系。例如，网页是资源，网页上的按钮、文本框等对象也是资源，是网页节点的子节点，如可以访问按钮，则必须能够访问页面。 2.这里提及的资源概念是指资源的类别（Resource Class），不是某个特定资源的实例（Resource Instance）。资源的类别和资源的实例的区分，以及资源的粒度的细分，有利于确定权限管理系统和应用系统之间的管理边界，权限管理系统需要对于资源的类别进行权限管理，而应用系统需要对特定资源的实例进行权限管理。两者的区分主要是基于以下两点考虑：一方面，资源实例的权限常具有资源的相关性。即根据资源实例和访问资源的主体之间的关联关系，才可能进行资源的实例权限判断。 例如，在管理信息系统中，需要按照营业区域划分不同部门的客户，A区和B区都具有修改客户资料这一受控的资源，这里“客户档案资料”是属于资源的类别的范畴。如果规定A区只能修改A区管理的客户资料，就必须要区分出资料的归属，这里的资源是属于资源实例的范畴。客户档案（资源）本身应该有其使用者的信息（客户资料可能就含有营业区域这一属性），才能区分特定资源的实例操作，可以修改属于自己管辖的信息内容。另一方面，资源的实例权限常具有相当大的业务逻辑相关性。对不同的业务逻辑，常常意味着完全不同的权限判定原则和策略。 b.权限：对受保护的资源操作的访问许可(Access Permission)，是绑定在特定的资源实例上的。对应地，访问策略（Access Strategy）和资源类别相关，不同的资源类别可能采用不同的访问模式（Access Mode）。例如，页面具有能打开、不能打开的访问模式，按钮具有可用、不可用的访问模式，文本编辑框具有可编辑、不可编辑的访问模式。同一资源的访问策略可能存在排斥和包含关系。例如，某个数据集的可修改访问模式就包含了可查询访问模式。 c.用户：是权限的拥有者或主体。用户和权限实现分离，通过授权管理进行绑定。 d.用户组：一组用户的集合。在业务逻辑的判断中，可以实现基于个人身份或组的身份进行判断。系统弱化了用户组的概念，主要实现用户（个人的身份）的方式。 e.角色：权限分配的单位与载体。角色通过继承关系支持分级的权限实现。例如，科长角色同时具有科长角色、科内不同业务人员角色。 f.操作：完成资源的类别和访问策略之间的绑定。 g.分配角色权限PA：实现操作和角色之间的关联关系映射。 h.分配用户角色UA：实现用户和角色之间的关联关系映射。 该对象模型最终将访问控制模型转化为访问矩阵形式。访问矩阵中的行对应于用户，列对应于操作，每个矩阵元素规定了相应的角色，对应于相应的目标被准予的访问许可、实施行为。按访问矩阵中的行看，是访问能力表CL(Access Capabilities)的内容；按访问矩阵中的列看，是访问控制表ACL（Access Control Lists）的内容。 一切只有此图可说明：（整理自己电脑资料,也不知哪位博友原创了，在此感谢！）","categories":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}],"tags":[{"name":"RBAC","slug":"RBAC","permalink":"http://lolee.cn/tags/RBAC/"}],"keywords":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}]},{"title":"共勉之","slug":"生活点滴记录于此","date":"2017-08-23T06:23:23.000Z","updated":"2019-04-29T11:07:12.935Z","comments":true,"path":"2017/08/23/生活点滴记录于此/","link":"","permalink":"http://lolee.cn/2017/08/23/生活点滴记录于此/","excerpt":"&ensp;时光荏苒，如白驹过隙，转眼间已毕业四年有余，然一事无成，晃晃度日，离职准备半年有余，先是为了刷新自己履历，去了国外子公司工作若月，回国后，依然徘徊不定。 ——-生活点滴记录于此 &ensp; 感谢曾经努力的自己。但努力远远的不够，想想自己得到了什么，精神上？物质上？还是技术的升华？","text":"&ensp;时光荏苒，如白驹过隙，转眼间已毕业四年有余，然一事无成，晃晃度日，离职准备半年有余，先是为了刷新自己履历，去了国外子公司工作若月，回国后，依然徘徊不定。 ——-生活点滴记录于此 &ensp; 感谢曾经努力的自己。但努力远远的不够，想想自己得到了什么，精神上？物质上？还是技术的升华？只能撇撇嘴，什么都没有，砂砾星辰，随波逐流尔，唯一痛并快乐着的事情，很简单，在怀疑浪费着生命，机械般的活着，按时上班下班，轻松的工作，也许这也是很多人梦寐以求的工作方式，可年轻的生命就这样延续浪费吗？曾经的抱负呢，醒来吧，醒来吧….至于为何来到这里，不想去记录，也不想回忆，而后坚持这么久，可能完全自己的惰性，经常调侃自己半死不活的状态，是来养老的。&ensp; 这几天一直在想我有放手一搏的本钱吗？金钱？权利？圈子？没有一样。仅剩下的网络时代赋予我最后的希望，真的要举起自己“引以为豪”的杀手锏吗，输了什么都没有了，还有何颜面？困难，前路坎坷，充满挑战，稍不注意还会翻车…唯一能做的就是降到最低，大不了在浪费两年时光，从零再来。&ensp;「梦想有朝一日成为 PPT 架构师」，一句调侃，隐含着对前路的追求，PPT能走入现实，PPT也能融资，只愿自己太愚笨，不懈努力之。&ensp;虽然我现在的程度距离我追求的高度还差了十万八千里，但是进一寸有一寸的欢喜，怕什么真理无穷。&ensp;很多时候我们只看见别人吃肉，没看见别人挨打，结果轮到自己上场的时候，肉没吃着，还白挨了一顿打。所以有肉吃的时候要抓住机会多吃点，挨打的时候才能多扛一阵。&ensp;共勉之。 —- By Devin.得文 —-","categories":[{"name":"杂谈","slug":"杂谈","permalink":"http://lolee.cn/categories/杂谈/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://lolee.cn/tags/随笔/"}],"keywords":[{"name":"杂谈","slug":"杂谈","permalink":"http://lolee.cn/categories/杂谈/"}]},{"title":"记我的第一份职业生涯","slug":"记我的第一份职业生涯","date":"2017-08-22T02:15:23.000Z","updated":"2019-04-29T11:02:06.638Z","comments":true,"path":"2017/08/22/记我的第一份职业生涯/","link":"","permalink":"http://lolee.cn/2017/08/22/记我的第一份职业生涯/","excerpt":"&emsp;很久很久没有写过东西了，曾经排山倒海的文笔也消失不见，想好很多很多要说，提起笔来…哈哈哈，忘完了..草草几句，以此作念！&emsp;没有上学时，希冀着大学的美好，当真的毕业了，又怀念过去的时光，人啊，真的是失去的才是最好的，抓不着的才是最美的吗？真TMD贱，shit….","text":"&emsp;很久很久没有写过东西了，曾经排山倒海的文笔也消失不见，想好很多很多要说，提起笔来…哈哈哈，忘完了..草草几句，以此作念！&emsp;没有上学时，希冀着大学的美好，当真的毕业了，又怀念过去的时光，人啊，真的是失去的才是最好的，抓不着的才是最美的吗？真TMD贱，shit…. &ensp;想着毕业那会，心里那个忐忑，又憧憬又害怕，憧憬着终于毕业了，可以开始涂画自己的一片天了，害怕走向社会，面对残酷的洗礼。时至今日，倒也无所谓了，残酷就残酷些吧，所谓的随遇而安，只不过是像我这样没什么追求的人吧，后来人可别学我。说没有追求似乎不真，曾幻想像谁谁谁一样，一个商业奇才，一个技术帝，一个暴发户，哎，做梦呢？天天窝在这么一个地方工作，谈什么理想，被人耻笑了，所以我毅然决然的定了 辞职去寻找渺茫的星途… &ensp; 我本一个有着自卑心的人，慢慢的养成了一个不善于与人打交道的人，特羡慕那些可以在人群如鱼得水的乐，记得初中那会，有两个笔记本，一本做摘抄，挑选哲理锦句；一本没事就写诗，五言七言绝句律诗现代诗，厚厚一本写了半本，现在想想忒有才吧，也许那时候就是一个分水岭，也许因为外在环境，慢慢养成了这种内向(那以前的以后有机会再写本回忆录哈哈)。说这些就是想说一句话，第一份工作很重要，但开朗健谈更重要，也许你能力一般，但你可以招致上面的人喜欢，你就比别人机会更大，这也是我最想对将来人说的真心话。 &ensp;&ensp;&ensp;&ensp; 在一个地方呆久了，人变得慵懒起来了， 技不在精，有广则灵乎？闲静少言， 不慕荣利。 好读书， 不求甚解； 每有会意， 便欣然忘食。哎，读书欲精不欲博、灵魂欲化庄周蝶，立雪深时道已传、勉之期不止！见笑见笑，只为镜鉴自己~ &ensp; 心情很糟想写些什么，却等打开微博就不知道要说些什么，有些事情说也说不清楚～终于，最后所有的所有我必须选择摒弃！感谢曾经帮助过和伤害我的人朋友，即将开启新的人生！必须要和过去Saygoodbye了！没想到最后要离开的心情竟是这般！心如止水，物是人非，曾经以为世界很美，没人掉眼泪！童话里都是骗人的！ 今朝此决无悔期，盲途亦求志不渝； 待我有成见此文，我定把酒歌以对。 回首向来萧瑟处，也无风雨也无晴。 竹杖芒鞋轻胜马，一蓑烟雨任平生。 梦想还是要有的，万一实现了呢！不便谈论的便不谈了，心知即可，点到为止。 &gt;- Devin.得文(以后以此笔名)","categories":[{"name":"杂谈","slug":"杂谈","permalink":"http://lolee.cn/categories/杂谈/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://lolee.cn/tags/随笔/"}],"keywords":[{"name":"杂谈","slug":"杂谈","permalink":"http://lolee.cn/categories/杂谈/"}]},{"title":"Dbschema 用法总结","slug":"Dbschema 用法总结","date":"2017-08-20T08:20:00.000Z","updated":"2019-04-29T05:01:57.841Z","comments":true,"path":"2017/08/20/Dbschema 用法总结/","link":"","permalink":"http://lolee.cn/2017/08/20/Dbschema 用法总结/","excerpt":"以下是日常经验积累和常用的代码收集，没有任何技术含量，仅填坑。 dbschema 用法：dbschema [-t tabname] [-s user] [-p user] [-r rolename] [-f procname] [-hd tabname] -d dbname [-ss] [filename] -t 表格名称 或 \\&quot;all\\&quot; 以选择所有的表格","text":"以下是日常经验积累和常用的代码收集，没有任何技术含量，仅填坑。 dbschema 用法：dbschema [-t tabname] [-s user] [-p user] [-r rolename] [-f procname] [-hd tabname] -d dbname [-ss] [filename] -t 表格名称 或 \\&quot;all\\&quot; 以选择所有的表格 -s 由该用户所建立的别名,或 \\&quot;all\\&quot; 以选择所有的使用者 -ss 建立服务器特定的语法 -p 由该用户所设定的访问权限或 \\&quot;all\\&quot; 以选择所有的使用者 -r 建立和授权给特定角色 或 \\&quot;all\\&quot; 表全部角色 : 不正确的 SE 选项 -f 所储存程序的名称 或 \\&quot;all\\&quot; 以选择所有已储存的程序 -d 数据库名称：文件名是指用来储存由 dbschema 所产生的 SQL 叙述的文件名. -hd 一个指定表格的字段, 一个特定的表格字段的直方图的分布或 \\&quot;all\\ &quot; 以选择所有的表格. 示例：1）导出数据库中所有的表结构到文件db.sql $&gt;dbschema -d your_database -t all db.sql 2) 导出数据库中所有的存储过程到文件db.sql $&gt;dbschema -d your_database -f all db.sql 3）导出数据库中的所有对象（包含表，存储过程，触发器。。。）到文件db.sql $&gt;dbschema -d your_database db.sql 4）导出数据库中一个表的结构到文件db.sql $&gt;dbschema -d your_database_name -t your_table_name db.sql 5）导出一个存储过程定义到文件db.sql $&gt;dbschema -d your_database_name -f your_procedure_name db.sql 6) 如果导出更多的表的信息(EXTENT…) $&gt;dbschema -d your_database_name -ss db.sql 7) 导出数据库中对用户或角色的授权信息 $&gt;dbschema -d your_database_name -p all $&gt;dbschema -d your_database_name -r all 8) 导出数据库中的同义词 $&gt;dbschema -d your_database_name -s all 9) 导出表数据到temp.unl文件 $&gt;unload to filename.unl select * from tabname; 10) 将temp.unl文件的内容导入表： $&gt;load from filename.unl insert into tabname; 本文根据自己经验整理所得，原创技术贴，转载请注明出处 Lolee By Devin","categories":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}],"tags":[{"name":"linux","slug":"linux","permalink":"http://lolee.cn/tags/linux/"},{"name":"unix","slug":"unix","permalink":"http://lolee.cn/tags/unix/"},{"name":"SQL","slug":"SQL","permalink":"http://lolee.cn/tags/SQL/"},{"name":"数据库","slug":"数据库","permalink":"http://lolee.cn/tags/数据库/"}],"keywords":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}]},{"title":"分享一个grep用法实例","slug":"grep用法实例","date":"2017-08-18T08:20:00.000Z","updated":"2019-04-29T04:56:09.580Z","comments":true,"path":"2017/08/18/grep用法实例/","link":"","permalink":"http://lolee.cn/2017/08/18/grep用法实例/","excerpt":"以下是日常经验积累和常用的代码收集，没有任何技术含量，仅填坑。 更多经验请关注http://www.lolee.cn grep用法实例 一.实例 1.同時滿足多個關鍵字 1grep -l &quot;cdrdlh&quot; *.4gl|xargs grep &quot;shpdat&quot;|pg 2.滿足某個關鍵字","text":"以下是日常经验积累和常用的代码收集，没有任何技术含量，仅填坑。 更多经验请关注http://www.lolee.cn grep用法实例 一.实例 1.同時滿足多個關鍵字 1grep -l &quot;cdrdlh&quot; *.4gl|xargs grep &quot;shpdat&quot;|pg 2.滿足某個關鍵字1grep -E &quot;cdrdlh|shpdat&quot; *.4gl|pg 3.cp查找出來的文件1cp `grep -l &quot;cdrdlh&quot; *.4gl|xargs grep -l &quot;shpdat&quot;` /dir 二.用法grep的常用选项：1234567-V： 打印grep的版本号-E： 解释PATTERN作为扩展正则表达式，也就相当于使用egrep。 或操作-F: 解释PATTERN作为固定字符串的列表，由换行符分隔，其中任何一个都要匹配。也就相当于使用fgrep。-G: 将范本样式视为普通的表示法来使用。这是默认值。加不加都是使用grep。 匹配控制选项：12345678910111213-e : 使用PATTERN作为模式。这可以用于指定多个搜索模式，或保护以连字符（ - ）开头的图案。指定字符串做为查找文件内容的样式。 -f : 指定规则文件，其内容含有一个或多个规则样式，让grep查找符合规则条件的文件内容，格式为每行一个规则样式。-i : 搜索时候忽略大小写-v: 反转匹配，选择没有被匹配到的内容。-w：匹配整词，精确地单词,单词的两边必须是非字符符号(即不能是字母数字或下划线)-x：仅选择与整行完全匹配的匹配项。精确匹配整行内容(包括行首行尾那些看不到的空格内容都要完全匹配)-y：此参数的效果和指定“-i”参数相同。 一般输出控制选项：123456789101112131415-c： 抑制正常输出;而是为每个输入文件打印匹配线的计数。--color [= WHEN]：让关键字高亮显示，如--color=auto-L：列出文件内容不符合指定的范本样式的文件名称-l : 列出文件内容符合指定的范本样式的文件名称。-m num：当匹配内容的行数达到num行后,grep停止搜索,并输出停止前搜索到的匹配内容-o: 只输出匹配的具体字符串,匹配行中其他内容不会输出-q：安静模式,不会有任何输出内容,查找到匹配内容会返回0,未查找到匹配内容就返回非0-s：不会输出查找过程中出现的任何错误消息，-q和-s选项因为与其他系统的grep有兼容问题，shell脚本应该避免使用-q和-s，并且应该将标准和错误输出重定向到/dev/null 代替。 输出线前缀控制：1234567891011-b：输出每一个匹配行(或匹配的字符串)时在其前附加上偏移量(从文件第一个字符到该匹配内容之间的字节数)-H：在每一个匹配行之前加上文件名一起输出(针对于查找单个文件),当查找多个文件时默认就会输出文件名-h：禁止输出上的文件名的前缀。无论查找几个文件都不会在匹配内容前输出文件名--label = LABEL：显示实际来自标准输入的输入作为来自文件LABEL的输入。这是特别在实现zgrep等工具时非常有用，例如gzip -cd foo.gz | grep --label = foo -H的东西。看到 也是-H选项。-n：输出匹配内容的同时输出其所在行号。-T：初始标签确保实际行内容的第一个字符位于制表位上，以便对齐标签看起来很正常。在匹配信息和其前的附加信息之间加入tab以使格式整齐。 上下文线控制选项：12345-A num：匹配到搜索到的行以及该行下面的num行-B num：匹配到搜索到的行以及该行上面的num行-C num：匹配到搜索到的行以及上下各num行 文件和目录选择选项：1234567891011121314151617-a： 处理二进制文件，就像它是文本;这相当于--binary-files = text选项。不忽略二进制的数据。 --binary-files = TYPE：如果文件的前几个字节指示文件包含二进制数据，则假定该文件为类型TYPE。默认情况下，TYPE是二进制的，grep通常输出一行消息二进制文件匹配，或者如果没有匹配则没有消息。如果TYPE不匹配，grep假定二进制文件不匹配;这相当于-I选项。如果TYPE是文本，则grep处理a二进制文件，如果它是文本;这相当于-a选项。警告：grep --binary-files = text可能会输出二进制的垃圾，如果输出是一个终端和如果可能有讨厌的副作用终端驱动程序将其中的一些解释为命令。-D：如果输入文件是设备，FIFO或套接字，请使用ACTION处理。默认情况下，读取ACTION，这意味着设备被读取，就像它们是普通文件一样。如果跳过ACTION，设备为 默默地跳过。-d: 如果输入文件是目录，请使用ACTION处理它。默认情况下，ACTION是读的，这意味着目录被读取，就像它们是普通文件一样。如果跳过ACTION，目录将静默跳过。如果ACTION是recurse，grep将递归读取每个目录下的所有文件;这是相当于-r选项。--exclude=GLOB：跳过基本名称与GLOB匹配的文件（使用通配符匹配）。文件名glob可以使用*，？和[...]作为通配符，和\\引用通配符或反斜杠字符。搜索其文件名和GLOB通配符相匹配的文件的内容来查找匹配使用方法:grep -H --exclude=c* &quot;old&quot; ./* c*是通配文件名的通配符./* 指定需要先通配文件名的文件的范围,必须要给*,不然就匹配不出内容,(如果不给*,带上-r选项也可以匹配)--exclude-from = FILE：在文件中编写通配方案,grep将不会到匹配方案中文件名的文件去查找匹配内容--exclude-dir = DIR：匹配一个目录下的很多内容同时还要让一些子目录不接受匹配,就使用此选项。 --include = GLOB：仅搜索其基本名称与GLOB匹配的文件（使用--exclude下所述的通配符匹配）。-R ,-r :以递归方式读取每个目录下的所有文件; 这相当于-d recurse选项。 其他选项：1234567--line-buffered： 在输出上使用行缓冲。这可能会导致性能损失。--mmap：启用mmap系统调用代替read系统调用-U：将文件视为二进制。-z：将输入视为一组行，每一行由一个零字节（ASCII NUL字符）而不是a终止新队。与-Z或--null选项一样，此选项可以与排序-z等命令一起使用来处理任意文件名。 本文根据自己经验整理所得，原创技术贴，转载请注明出处 Lolee By Devin","categories":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}],"tags":[{"name":"linux","slug":"linux","permalink":"http://lolee.cn/tags/linux/"},{"name":"unix","slug":"unix","permalink":"http://lolee.cn/tags/unix/"},{"name":"shell","slug":"shell","permalink":"http://lolee.cn/tags/shell/"}],"keywords":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}]},{"title":"前端資源汇总 推荐②","slug":"前端资源2","date":"2016-12-21T15:39:18.000Z","updated":"2019-04-29T11:10:51.794Z","comments":true,"path":"2016/12/21/前端资源2/","link":"","permalink":"http://lolee.cn/2016/12/21/前端资源2/","excerpt":"书籍、视频、作品门户、博客、面试、算法、CDN….. 我只是喜欢收集，分享给有需要的人… 也许是一些过时的东西… 也许是一些不起眼的技术… 也许是一些互联网的遗弃… 但总希望如果帮到你了呢… 一.综合类","text":"书籍、视频、作品门户、博客、面试、算法、CDN….. 我只是喜欢收集，分享给有需要的人… 也许是一些过时的东西… 也许是一些不起眼的技术… 也许是一些互联网的遗弃… 但总希望如果帮到你了呢… 一.综合类 - [前端知识体系](http://www.cnblogs.com/sb19871023/p/3894452.html) 二.入门类- [前端入门教程](http://www.cnblogs.com/jikey/p/3613082.html) 三.效果类- [弹出层](http://www.imooc.com/learn/58) - [焦点图轮播特效](http://www.imooc.com/learn/18) 四.工具类- [css sprite 雪碧图制作](http://www.imooc.com/learn/93) - [版本控制入门 – 搬进 Github](http://www.imooc.com/learn/390) - [Grunt-beginner前端自动化工具](http://www.imooc.com/learn/30) 五. 慕课专题- [张鑫旭 - 慕课系列](http://www.imooc.com/space/teacher/id/197450) - [lyn - 慕课系列](http://www.imooc.com/space/teacher/id/104593) - [艾伦 - 慕课系列](http://www.imooc.com/space/teacher/id/290139) - [碧仔 - Hello，移动WEB](http://www.imooc.com/view/494) 六. 作品展示:七. 设计门户网站 集合网站 设计师导航网站 uehtml网络收藏 门户网站 最流行的PHP 代码规范 最流行的PHP 代码规范 英文设计网站 【敏捷开发】Android团队开发规范 Android 开发规范与应用 其它网站 涂鸦网站 八. 素材网站1. ICON搜索 Facebook Projects 百度web前端研发部 百度EFE 百度github alloyteam alloyteam-github alloyteam-AlloyGameEngine AlloyDesigner 即时修改，即时保存，设计稿较正，其它开发辅助工具 H5交互页编辑器AEditor介绍 H5动画交互页开发的工具介绍 AEditor H5动画交互页开发的工具 maka 值得订阅的weekly 腾讯html5 奇舞团开源项目 Qunar UED 2. PSD其它搜索 常用 ieBetter.js-让IE6-IE8拥有IE9+,Chrome等浏览器特性 模拟键盘 拼音 中国个人身份证号验证 算法 数据结构与算法 JavaScript 描述. 章节练习 常见排序算法（JS版） 经典排序 常见排序算法-js版本 JavaScript 算法与数据结构 精华集 面试常考算法题精讲 移动端 fastclick no-click-delay JSON 模拟生成JSON数据 返回跨域JSONAPI 3. Html5 HTML5 有哪些让你惊艳的 demo？ 4. CSS browserhacks 5. jQuery 焦点图 myfocus myfocus-官方演示站 SuperSlidev2.1 – 大话主席 soChange 6. Ext, EasyUI, J-UI 及其它各种UI方案 Ext extjs ext4英文api ext4中文api EasyUI jquery easyui 未压缩源代码 J-UI J-UI Other MUI-最接近原生APP体验的高性能前端框架 Amaze UI | 中国首个开源 HTML5 跨屏前端框架 淘宝 HTML5 前端框架 KISSY - 阿里前端JavaScript库 网易Nej - Nice Easy Javascript Kendo UI MVVM Demo Bootstrap Smart UI 雅虎UI - CSS UI 7. 页面 社会化 分享功能 百度分享 pc端 JiaThis pc端 社会化分享组件 移动端 ShareSDK 轻松实现社会化功能 移动端 友盟分享 移动端 8. 富文本编辑器 百度 ueditor 经典的ckeditor 经典的kindeditor wysiwyg 一个有情怀的编辑器。Bach’s Editor tower用的编辑器 summernote 编辑器 html5编辑器 XEditor wangEditor 9. 日历 PC 经典my97 强大的独立日期选择器 fullcalendar fullcalendar日历控件知识点集合 中文api 农历日历 超酷的仿百度带节日日历老黄历控件 日期格式化 大牛日历控件 我群某管理作品 input按位替换-官网 input按位替换-github bootstrap-daterangepicker 国外30个插件集合 JavaScript datepicker Datepair.js 一个风格多样的日历 弹出层式的全日历 jquery双日历 移动 大气实用jQuery手机移动端日历日期选择插件 jQuery Mobile 移动开发中的日期插件Mobiscroll Date library Datejs sugarjs 10. 综合效果搜索平台 效果网 17素材 常用的JavaScript代码片段 11. 前端工程化 概述 前端工具大全 什么是前端工程化 Gulp Gulp官网 Gulp中文网 gulp资料收集 Gulp：任务自动管理工具 - ruanyifeng Gulp插件 Gulp不完全入门教程 为什么使用gulp? Gulp安装及配合组件构建前端开发一体化 Gulp 入门指南 Gulp 入门指南 - nimojs Gulp入门教程 Gulp in Action Gulp开发教程（翻译） 前端构建工具gulpjs的使用介绍及技巧 Grunt gruntjs Grunt中文网 Fis fis 官网 fis 12. 轮播图 pc图轮 单屏轮播sochange 左右按钮多图切换 fullpage全屏轮播 移动端 无缝切换 滑屏效果 全屏fullpage 单个图片切换 单个全屏切换 百度的切换库 单个全屏切换 滑屏效果 旋转拖动设置 类似于swipe切换 支持多种形式的触摸滑动 滑屏效果 大话主席pc移动图片轮换 滑屏效果 基于zepto的fullpage [WebApp]定宽网页设计下，固定宽度布局开发WebApp并实现多终端下WebApp布局自适应 判断微信客户端的那些坑 可以通过javascript直接调用原生分享的工具 JiaThis 分享到微信代码 聊聊移动端跨平台开发的各种技术 前端自动化测试 多种轮换图片 滑动侧边栏 13. 文件上传 百度上传组件 上传 flash 头像上传 图片上传预览 图片裁剪 图片裁剪-shearphoto jQuery图片处理 14. 模拟select 糖饼 select flexselect 双select select2 15. 取色插件 类似 Photoshop 的界面取色插件 jquery color 取色插件集合 farbtastic 圆环＋正方形 16. 城市联动 jquery.cityselect.js基于jQuery+JSON的省市或自定义联动效果 17. 剪贴板 剪贴板 clipboard 最新的剪切方案 不是Flash的剪贴板 18. 简繁转换 简繁转换 19. 表格 Grid facebook表格 类似于Excel编辑表格-handsontable bootstrap-table插件 datatables 20. 在线演示 js 在线编辑 - runjs js 在线编辑 - jsbin js 在线编辑 - codepen js 在线编辑 - jsfiddle java 在线编辑 - runjs js 在线编辑 - hcharts js 在线编辑 - jsdm sql 在线编辑 - sqlfiddle mozilla 在线编辑器 21. 播放器 Html5 VideoPlayer 22. 粒子动画 Proton 烟花 九. Nodejs nodejs 篇幅比较巨大 Node.js 包教不包会 篇幅比较少 node express 入门教程 nodejs定时任务 一个nodejs博客 【NodeJS 学习笔记04】新闻发布系统 过年7天乐，学nodejs 也快乐 七天学会NodeJS Nodejs学习笔记（二）— 事件模块 nodejs入门 angularjs nodejs 从零开始nodejs系列文章 理解nodejs nodejs事件轮询 node入门 nodejs cms Node初学者入门，一本全面的NodeJS教程 NodeJS的代码调试和性能调优 十. 工具网站 常规优化 Javascript高性能动画与页面渲染 移动H5前端性能优化指南 5173首页前端性能优化实践 给网页设计师和前端开发者看的前端性能优化 复杂应用的 CSS 性能分析和优化建议 张鑫旭——前端性能 前端性能监控总结 网站性能优化之CSS无图片技术 web前端性能优化进阶路 前端技术：网站性能优化之CSS无图片技术 浏览器的加载与页面性能优化 页面加载中的图片性能优化 Hey——前端性能 html优化 99css——性能 Yslow——性能优化 YSLOW中文介绍 转一篇Yahoo关于网站性能优化的文章，兼谈本站要做的优化 Yahoo!团队实践分享：网站性能 网站性能优化指南：什么使我们的网站变慢？ 网站性能优化实践，减少加载时间，提高用户体验 浅谈网站性能优化 前端篇 前端重构实践之如何对网站性能优化？ 前端性能优化：使用媒体查询加载指定大小的背景图片 网站性能系列博文 加载，不只是少一点点 前端性能的测试与优化 分享网页加载速度优化的一些技巧？ 页面加载中的图片性能优化 web前端优化(基于Yslow) 网站性能优化工具大全 【高性能前端1】高性能HTML 【高性能前端2】高性能CSS 由12306谈谈网站前端性能和后端性能优化 AlloyTeam——前端优化 毫秒必争，前端网页性能最佳实践 网站性能工具Yslow的使用方法 前端工程与性能优化（上）：静态资源版本更新与缓存 前端工程与性能优化（下）：静态资源管理与模板框架 HTTPS连接的前几毫秒发生了什么 Yslow Essential Web Performance Metrics — A Primer, Part 1 Essential Web Performance Metrics — Part 2 YUISlide,针对移动设备的动画性能优化 Improving Site Performance 让网站提速的最佳前端实践 Why Website Speed is Important Need for Speed – How to Improve your Website Performance 阿里无线前端性能优化指南 (Pt.1 加载期优化) 优化工具 JavaScript 性能分析新工具 OneProfile JavaScript 堆内存分析新工具 OneHeap 在线工具 google在线工具 阿里测 阿里-免费测试服务 阿里-F2etest多浏览器兼容性测试解决方案 js性能测试 十一. 个人优秀设计网站 技术架构 前端架构 如何成为前端架构师 关于前端架构-张克军 百度腾讯offer比较（腾讯游戏VS百度基础架构） 十二. 代码分享1. 推荐作品 winter代码片段需要翻墙 fgm 岑安作品集 当耐特demo集合 米空格 js作品 myFocus jssdk flash开发组件 抽奖转盘 SeaJS组件库 颜海镜作品 脚儿网作品 javascript个人作品 妙味的雷东升游戏作品 javascript作品集 云五笔，灰度产生生成工具 项目主页 个性的作品主页 播放器 ucren js demos 集 智能社 实例陈列架 zoye demo 王员外 平凡 jyg 游戏案例 很多jquery插件 不羁虫 - soJs 作品系列 frozenui 黑白棋 fromone 2. 群员作品 MDialog - [合肥-M.J] 轮播图 - [上海－冷静] [广州—坚壳] [成都 - 无痕] 感恩节专题 [球霸天] [北京-小数] [ptf] Magix 工具 [杭州-Pft] Magix 基于 MVC 结构和 Hash 驱动的 OPOA（One Page One Application）应用 [上海-剧中人]-实验室 [上海-豪情 ] 作品集合 [成都-feeling] [上海-angela] [海南-hank]作品 [上海-张力]博客 [上海-zenki]作品 移动端图案解锁 [合肥-M.J] - MPreview 移动端图片预览组 [合肥-M.J] - Mexam 移动端在线做题组 [北京-苏瑞] - dancer小人 [上海-玄沐]- 个人网站 [厦门-二哲]- 个人博客 3. 国外大牛精品 pazguille 十三. 简历模板 不错的个人简历 简历 张伦 简历 翁天信 动画方式的简历 组件丰富简历 简历池 haorooms博客 Justin Young 十四. 面试题 那几个月在找工作（百度，网易游戏） 2014最新面试题 阿里前端面试题 2016校招内推 – 阿里巴巴前端 – 三面面试经历 腾讯面试题 年后跳槽那点事：乐视+金山+360面试之行 阿里前端面试题上线 拉勾网js面试题 前端面试 Web开发笔试面试题 大全 前端开发面试题 2014最新前端面试题 百度面试 面试题 前端工作面试问题 前端开发面试题 5个经典的前端面试问题 最全前端面试问题及答案总结 如何面试一名前端开发工程师？ 史上最全 前端开发面试问题及答案整理 前端实习生面试总结 史上最全 前端开发面试问题及答案整理 BAT及各大互联网公司2014前端笔试面试题：JavaScript篇 前端开发面试题大收集 收集的前端面试题和答案 如何面试前端工程师 前端开发面试题 牛客网-笔试面经 十五. iconfont十六. 开发工具类 前端开发工具 IntelliJ IDEA 简体中文专题教程 Webstorm,InterllIdea,Phpstorm SublimeText Atom visual studio code Chrome, Firebug, Filddle 调试 Fiddler Fiddler调式使用知多少(一)深入研究 微信fiddle 微信fiddle Chrome Google Chrome 官方 Chrome - 基础 Chrome - 进阶 Chrome - 性能 Chrome - 性能进阶 Chrome - 移动 Chrome - 使用技巧 Chrome - Console控制台不完全指南 Chrome - Workspace使浏览器变成IDE network面板 chrome开发工具快捷键 chrome调试工具常用功能整理 Chrome 开发工具 Workspace 使用 Chrome神器Vimium快捷键学习记录 sass调试-w3cplus 如何更专业的使用Chrome开发者工具-w3cplus chrome调试canvas chrome profiles1 chrome profiles2 chrome profiles3 chrome移动版调试 chrome调试 chrome的调试 chrome console 命令详解 查看事件绑定1 查看事件绑定2 神器——Chrome开发者工具(一) 奇趣百科性能优化(Chrome DevTools 中的 Timeline Profils 等工具使用介绍) chrome 开发者工具的 15 个小技巧 Chrome开发者工具不完全指南 Chrome 开发者工具使用技巧 Firebug firebug视频教程 firefox 模拟器 console.log 命令详解 Firebug入门指南 Firebug控制台详解 移动,微信调试 浏览器端调试安卓 移动端前端开发调试 使用 Chrome 远程调试 Android 设备 mac移动端调试 mac移动端调试 无线调试攻略 无线调试攻略 屌爆了,完美调试 微信webview(x5) 微信调试的那些事 远程console 微信调试工具 各种真机远程调试方法汇总 iOS Simulator Simulator Xcode中的iOS模拟器(iOS Simulator)的介绍和使用心得 img loading img 智图-图片优化平台 在线png优化 生成二维码 生成二维码 浏览器同步 puer liveReload f5 File Watchers 在线PPT制作 PPT reveal slippy 十七. 前端导航网站十八. 常用CDN十九. Git,SVN,Github","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"资源汇总","slug":"资源汇总","permalink":"http://lolee.cn/tags/资源汇总/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"免费的编程中文书籍索引","slug":"文档书籍","date":"2016-12-21T11:31:18.000Z","updated":"2019-04-29T05:12:09.213Z","comments":true,"path":"2016/12/21/文档书籍/","link":"","permalink":"http://lolee.cn/2016/12/21/文档书籍/","excerpt":"国外程序员在 stackoverflow 推荐的程序员必读书籍，中文版。 stackoverflow 上的程序员应该阅读的非编程类书籍有哪些？ 中文版 github 上的一个流行的编程书籍索引 中文版 参与交流欢迎大家将珍藏已久的经典免费书籍共享出来…","text":"国外程序员在 stackoverflow 推荐的程序员必读书籍，中文版。 stackoverflow 上的程序员应该阅读的非编程类书籍有哪些？ 中文版 github 上的一个流行的编程书籍索引 中文版 参与交流欢迎大家将珍藏已久的经典免费书籍共享出来… 目录 语言无关类 操作系统 智能系统 分布式系统 编译原理 函数式概念 计算机图形学 WEB服务器 版本控制 编辑器 NoSQL PostgreSQL MySQL 管理和监控 项目相关 设计模式 Web 大数据 编程艺术 其它 语言相关类 Android APP AWK C/C++ C# Clojure CSS/HTML Dart Elixir Erlang Fortran Go Groovy Haskell iOS Java JavaScript LaTeX LISP Lua OCaml Perl PHP Prolog Python R Ruby Rust Scala Shell Swift 读书笔记及其它 测试相关 语言无关类操作系统 开源世界旅行手册 鸟哥的Linux私房菜 The Linux Command Line (中英文版) Linux 设备驱动 (第三版) 深入分析Linux内核源码 UNIX TOOLBOX Docker中文指南 Docker —— 从入门到实践 Docker入门实战 Docker Cheat Sheet FreeRADIUS新手入门 Mac 开发配置手册 FreeBSD 使用手册 Linux 命令行(中文版) Linux 构建指南 Linux工具快速教程 Linux Documentation (中文版) 嵌入式 Linux 知识库 (eLinux.org 中文版) 理解Linux进程 命令行的艺术 SystemTap新手指南 智能系统 一步步搭建物联网系统 分布式系统 走向分布式 编译原理 《计算机程序的结构和解释》公开课 翻译项目 函数式概念 傻瓜函数编程 计算机图形学 OpenGL 教程 WebGL自学网 WEB服务器 Nginx开发从入门到精通 (淘宝团队出品) Nginx教程从入门到精通(PDF版本，运维生存时间出品) OpenResty最佳实践 Apache 中文手册 版本控制 Git教程 （本文由 廖雪峰 创作，如果觉得本教程对您有帮助，可以去 iTunes 购买） git - 简易指南 猴子都能懂的GIT入门 Git 参考手册 Pro Git Pro Git 中文版 (整理在gitbook上) Git Magic GotGitHub Git权威指南 Git Community Book 中文版 Mercurial 使用教程 HgInit (中文版) 沉浸式学 Git Git-Cheat-Sheet （感谢 @flyhigher139 翻译了中文版） GitHub秘籍 GitHub帮助文档 git-flow 备忘清单 svn 手册 GitHub漫游指南 编辑器 exvim–vim 改良成IDE项目 笨方法学Vimscript 中译本 Vim中文文档 所需即所获：像 IDE 一样使用 vim Atom飞行手册中文版 Markdown·简单的世界 NoSQL NoSQL数据库笔谈 (PDF) Redis 设计与实现 Redis 命令参考 带有详细注释的 Redis 3.0 代码 带有详细注释的 Redis 2.6 代码 The Little MongoDB Book The Little Redis Book Neo4j 简体中文手册 v1.8 Neo4j .rb 中文資源 Disque 使用教程 PostgreSQL PostgreSQL 8.2.3 中文文档 PostgreSQL 9.3.1 中文文档 MySQL MySQL索引背后的数据结构及算法原理 21分钟MySQL入门教程 管理和监控 ELKstack 中文指南 Mastering Elasticsearch(中文版) ElasticSearch 权威指南 Elasticsearch 权威指南（中文版） Logstash 最佳实践 Puppet 2.7 Cookbook 中文版 项目相关 持续集成（第二版） (译言网) 让开发自动化系列专栏 追求代码质量 selenium 中文文档 Selenium Webdriver 简易教程 Joel谈软件) 約耳談軟體(Joel on Software) Gradle 2 用户指南 Gradle 中文使用文档 编码规范 开源软件架构 GNU make 指南 GNU make 中文手册 设计模式 图说设计模式 史上最全设计模式导学目录 design pattern 包教不包会 设计模式 Java 版 Web 关于浏览器和网络的 20 项须知 浏览器开发工具的秘密 Chrome 开发者工具中文手册 Chrome扩展开发文档 Grunt中文文档 gulp中文文档 Gulp 入门指南 移动Web前端知识库 正则表达式30分钟入门教程 前端开发体系建设日记 移动前端开发收藏夹 JSON风格指南 HTTP 接口设计指北 前端资源分享（一） 前端资源分享（二） 前端代码规范 及 最佳实践 前端开发者手册 前端工程师手册 w3school教程整理 Wireshark用户手册 一站式学习Wireshark HTTP 下午茶 HTTP/2.0 中文翻译 RFC 7540 - HTTP/2 中文翻译版 http2讲解 3 Web Designs in 3 Weeks 大数据 大数据/数据挖掘/推荐系统/机器学习相关资源 面向程序员的数据挖掘指南 大型集群上的快速和通用数据处理架构 数据挖掘中经典的算法实现和详细的注释 Spark 编程指南简体中文版 编程艺术 程序员编程艺术 每个程序员都应该了解的内存知识(译)【第一部分】 取悦的工序：如何理解游戏 (豆瓣阅读，免费书籍) 其它 OpenWrt智能、自动、透明翻墙路由器教程 SAN 管理入门系列 Sketch 中文手册 深入理解并行编程 程序员的自我修养 Growth: 全栈增长工程师指南 语言相关类Android Android Design(中文版) Google Material Design 正體中文版 (译本一 译本二) Material Design 中文版 Google Android官方培训课程中文版 Android学习之路 Android开发技术前线(android-tech-frontier) Point-of-Android Android 一些重要知识点解析整理 Android6.0新特性详解 APP Apache Cordova 开发指南 AWK awk程序设计语言 awk中文指南 C/C++ C/C++ 中文参考手册 (欢迎大家参与在线翻译和校对) C 语言编程透视 C++ 并发编程指南 Linux C编程一站式学习 (宋劲杉, 北京亚嵌教育研究中心) CGDB中文手册 100个gdb小技巧 100个gcc小技巧 ZMQ 指南 How to Think Like a Computer Scientist (中英文版) 跟我一起写Makefile(PDF) GNU make中文手册 GNU make 指南 Google C++ 风格指南 C/C++ Primer (by @andycai) 简单易懂的C魔法 Cmake 实践 (PDF版) C++ FAQ LITE(中文版) C++ Primer 5th Answers C++ 并发编程(基于C++11) QT 教程 DevBean的《Qt学习之路2》(Qt5) C++ Template 进阶指南 libuv中文教程 Boost 库中文教程 C&#35; MSDN C# 中文文档 .NET 类库参考 ASP.NET MVC 5 入门指南 超全面的 .NET GDI+ 图形图像编程教程 .NET控件开发基础 Clojure Clojure入门教程 CSS/HTML 学习CSS布局 通用 CSS 笔记、建议与指导 CSS参考手册 Emmet 文档 前端代码规范 (腾讯 AlloyTeam 团队) HTML和CSS编码规范 Sass Guidelines 中文 CSS3 Tutorial 《CSS3 教程》 MDN HTML 中文文档 MDN CSS 中文文档 Dart Dart 语言导览 Elixir Elixir编程入门 Erlang 21天学通Erlang Fortran Fortran77和90/95编程入门 Go Go编程基础 Go入门指南 学习Go语言 Go Web 编程 (此书已经出版，希望开发者们去购买，支持作者的创作) Go实战开发 (当我收录此项目时，作者已经写完第三章，如果读完前面章节觉得有帮助，可以给作者捐赠，以鼓励作者的继续创作) Network programming with Go 中文翻译版本 Effective Go Go 语言标准库 Revel 框架手册 Java程序员的Golang入门指南 Go命令教程 Go语言博客实践 Go 官方文档翻译 深入解析Go Go语言圣经(中文版) (GitBook) Groovy 实战 Groovy 系列 Haskell Real World Haskell 中文版 Haskell趣学指南 iOS iOS开发60分钟入门 iOS7人机界面指南 Google Objective-C Style Guide 中文版 iPhone 6 屏幕揭秘 Apple Watch开发初探 马上着手开发 iOS 应用程序 网易斯坦福大学公开课：iOS 7应用开发字幕文件 Java Apache Shiro 用户指南 Jersey 2.x 用户指南 Spring Framework 4.x参考文档 Spring Boot参考指南 (翻译中) MyBatis中文文档 MyBatis Generator 中文文档 用jersey构建REST服务 Activiti 5.x 用户指南 Google Java编程风格指南 Netty 4.x 用户指南 Netty 实战(精髓) REST 实战 Java 编码规范 Apache MINA 2 用户指南 H2 Database 教程 Java Servlet 3.1 规范 JSSE 参考指南 Java开源实现及最佳实践 Java 编程要点 Think Java JavaScript Google JavaScript 代码风格指南 Google JSON 风格指南 Airbnb JavaScript 规范 JavaScript 标准参考教程（alpha） Javascript编程指南 (源码) javascript 的 12 个怪癖 JavaScript 秘密花园 JavaScript核心概念及实践 (PDF) (此书已由人民邮电出版社出版发行，但作者依然免费提供PDF版本，希望开发者们去购买，支持作者) 《JavaScript 模式》 “JavaScript patterns”中译本 命名函数表达式探秘 (注:原文由为之漫笔翻译，原始地址无法打开，所以此处地址为我博客上的备份) 学用 JavaScript 设计模式 (开源中国) 深入理解JavaScript系列 ECMAScript 6 入门 (作者：阮一峰) JavaScript Promise迷你书 You-Dont-Know-JS (深入JavaScript语言核心机制的系列图书) JavaScript 教程 廖雪峰 MDN JavaScript 中文文档 jQuery jQuery 解构 简单易懂的JQuery魔法 How to write jQuery plugin You Don’t Need jQuery 如何实现一个类jQuery？ Node.js Node入门 七天学会NodeJS Nodejs Wiki Book (繁体中文) express.js 中文文档 koa 中文文档 一起学koa 使用 Express + MongoDB 搭建多人博客 Express框架 Node.js 包教不包会 Learn You The Node.js For Much Win! (中文版) Node debug 三法三例 nodejs中文文档 orm2 中文文档 underscore.js Underscore.js中文文档 backbone.js backbone.js中文文档 backbone.js入门教程 (PDF) Backbone.js入门教程第二版 Developing Backbone.js Applications(中文版) AngularJS AngularJS最佳实践和风格指南 AngularJS中译本 AngularJS入门教程 构建自己的AngularJS 在Windows环境下用Yeoman构建AngularJS项目 Zepto.js Zepto.js 中文文档 Sea.js Hello Sea.js React.js React.js 中文文档 React webpack-cookbook React 入门教程 React Native 中文文档(含最新Android内容) Learn React &amp; Webpack by building the Hacker News front page impress.js impress.js的中文教程 CoffeeScript CoffeeScript Cookbook The Little Book on CoffeeScript中文版 CoffeeScript 编码风格指南 TypeScipt TypeScript Handbook ExtJS Ext4.1.0 中文文档 Meteor Discover Meteor Meteor 中文文档 Angular-Meteor 中文教程 Chrome扩展及应用开发 LaTeX 一份其实很短的 LaTeX 入门文档 一份不太简短的 LATEX 2ε 介绍 （PDF版） LISP Common Lisp ANSI Common Lisp 中文翻譯版 On Lisp 中文翻译版本 Scheme Yet Another Scheme Tutorial Scheme入门教程 Scheme语言简明教程 Racket Racket book Lua Lua编程入门 Lua 5.1 参考手册 中文翻译 Lua 5.3 参考手册 中文翻译 Lua源码欣赏 OCaml Real World OCaml Perl Modern Perl 中文版 Perl 程序员应该知道的事 PHP PHP 官方手册 PHP调试技术手册(PDF) PHP之道：php-the-right-way (@wulijun版 PHPHub版) PHP 最佳实践 PHP 开发者实践 深入理解PHP内核 PHP扩展开发及内核应用 Laravel5 中文文档 Laravel 入门 Symfony2 Cookbook 中文版(版本 2.7.0 LTS) Symfony2中文文档 (未译完) YiiBook几本Yii框架的在线教程 深入理解 Yii 2.0 Yii 框架中文文檔 简单易懂的PHP魔法 swoole文档及入门教程 Composer 中文网 Slim 中文文档 Lumen 中文文档 PHPUnit 中文文档 Prolog 笨办法学Prolog Python 廖雪峰 Python 2.7 中文教程 廖雪峰 Python 3 中文教程 简明Python教程 零基础学 Python 第一版 零基础学 Python 第二版 可爱的 Python Python 2.7 官方教程中文版 Python 3.3 官方教程中文版 Python Cookbook 中文版 Python3 Cookbook 中文版 深入 Python 深入 Python 3 PEP8 Python代码风格规范 Google Python 风格指南 中文版 Python入门教程 (PDF) Python的神奇方法指南 笨办法学 Python (PDF EPUB) Python自然语言处理中文版 （感谢陈涛同学的翻译，也谢谢 @shwley 联系了作者） Python 绘图库 matplotlib 官方指南中文翻译 Scrapy 0.25 文档 ThinkPython ThinkPython 2ed Python快速教程 Python 正则表达式操作指南 python初级教程：入门详解 Twisted 与异步编程入门 TextGrocery 中文 API ( 基于svm算法的一个短文本分类 Python 库 ) Requests: HTTP for Humans Pillow 中文文档 PyMOTW 中文版 Python 官方文档中文版 Fabric 中文文档 Beautiful Soup 4.2.0 中文文档 用Python做科学计算 Sphinx 中文文档 精通 Python 设计模式 python 安全编程教程 程序设计思想与方法 知乎周刊·编程小白学Python Scipy 讲义 Python 学习笔记 基础篇 Python 学习笔记 模块篇 Python 标准库 中文版 Python进阶 Python 核心编程 第二版 CPyUG译 Django Django 1.5 文档中文版 正在翻译中 Diango 1.7 文档中文版 正在翻译中，目前只翻译了目录 Django 1.8.2 文档中文版正在翻译中 Django 最佳实践 Django搭建简易博客教程 The Django Book 中文版 Django 设计模式与最佳实践 Django 网站开发 Cookbook Django Girls 學習指南 Flask Flask 文档中文版 Jinja2 文档中文版 Werkzeug 文档中文版 Flask之旅 Flask 扩展文档汇总 Flask 大型教程 SQLAlchemy 中文文档 web.py web.py 0.3 新手指南 Web.py Cookbook 简体中文版 Tornado Introduction to Tornado 中文翻译 Tornado源码解析 Tornado 4.3 文档中文版 R R语言忍者秘笈 Ruby Ruby 风格指南 Rails 风格指南 笨方法學 Ruby Ruby on Rails 指南 Ruby on Rails 實戰聖經 Ruby on Rails Tutorial 原书第 3 版 (本书网页版免费提供，电子版以 PDF、EPub 和 Mobi 格式提供购买，仅售 9.9 美元) Rails 实践 Rails 5 开发进阶(Beta) Rails 102 编写Ruby的C拓展 Ruby 源码解读 Ruby中的元编程 Rust rust book 中文翻译 rust primer Scala Scala课堂 (Twitter的Scala中文教程) Effective Scala(Twitter的Scala最佳实践的中文翻译) Scala指南 Shell Shell脚本编程30分钟入门 Bash脚本15分钟进阶教程 Linux工具快速教程 shell十三问 Shell编程范例 Swift The Swift Programming Language 中文版 Swift 语言指南 Stanford 公开课，Developing iOS 8 Apps with Swift 字幕翻译文件 读书笔记及其它 编译原理（紫龙书）中文第2版习题答案 把《编程珠玑》读薄 Effective C++读书笔记 Golang 学习笔记、Python 学习笔记、C 学习笔记 (PDF) Jsoup 学习笔记 学习笔记: Vim、Python、memcached 图灵开放书翻译计划–C++、Python、Java等 蒂姆·奥莱利随笔 （由译言网翻译，电子版免费） SICP 解题集 精彩博客集合 正则表达式简明参考 中文文案排版指北 Standard C 语言标准函数库速查 (Cheat Sheet) Git Cheatsheet Chs GitBook简明教程 JavaScript语言精粹 制造开源软件 提问的智慧 Markdown 入门参考 AsciiDoc简明指南 背包问题九讲 老齐的技术资料 前端技能汇总 借助开源项目，学习软件开发 前端工作面试问题 leetcode/lintcode题解/算法学习笔记 前端开发笔记本","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"资源汇总","slug":"资源汇总","permalink":"http://lolee.cn/tags/资源汇总/"},{"name":"教程","slug":"教程","permalink":"http://lolee.cn/tags/教程/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"前端資源汇总 推荐①","slug":"前端資源1","date":"2016-12-21T11:31:18.000Z","updated":"2019-04-29T11:10:05.649Z","comments":true,"path":"2016/12/21/前端資源1/","link":"","permalink":"http://lolee.cn/2016/12/21/前端資源1/","excerpt":"书籍、视频、作品门户、博客、面试、算法、CDN….. 我只是喜欢收集，分享给有需要的人… 也许是一些过时的东西… 也许是一些不起眼的技术… 也许是一些互联网的遗弃… 但总希望如果帮到你了呢… 一、综合类","text":"书籍、视频、作品门户、博客、面试、算法、CDN….. 我只是喜欢收集，分享给有需要的人… 也许是一些过时的东西… 也许是一些不起眼的技术… 也许是一些互联网的遗弃… 但总希望如果帮到你了呢… 一、综合类 - [前端知识体系](http://www.cnblogs.com/sb19871023/p/3894452.html) - [前端知识结构](https://github.com/JacksonTian/fks) - [Web前端开发大系概览](https://github.com/unruledboy/WebFrontEndStack) - [Web前端开发大系概览-中文版](http://www.cnblogs.com/unruledboy/p/WebFrontEndStack.html) - [Web Front-end Stack v2.2](https://raw.githubusercontent.com/unruledboy/WebFrontEndStack/master/Web%20Front%20End%20Stack.png) - [En类资源汇总](https://github.com/sindresorhus/awesome) - [免费的编程中文书籍索引](https://github.com/justjavac/free-programming-books-zh_CN) - [前端书籍](https://github.com/dypsilon/frontend-dev-bookmarks) - [前端免费书籍大全](https://github.com/vhf/free-programming-books) - [前端知识体系](http://www.cnblogs.com/sb19871023/p/3894452.html) - [免费的编程中文书籍索引](https://github.com/justjavac/free-programming-books-zh_CN) - [智能社 - 精通JavaScript开发](http://study.163.com/course/introduction/224014.htm) - [重新介绍 JavaScript（JS 教程）](https://developer.mozilla.org/zh-CN/docs/Web/JavaScript/A_re-introduction_to_JavaScript) - [麻省理工学院公开课：计算机科学及编程导论](http://v.163.com/special/opencourse/bianchengdaolun.html) - [JavaScript中的this陷阱的最全收集--没有之一](http://segmentfault.com/a/1190000002640298) - [JS函数式编程指南](http://llh911001.gitbooks.io/mostly-adequate-guide-chinese/content/ch1.html) - [JavaScript Promise迷你书（中文版）](http://liubin.github.io/promises-book/) - [腾讯移动Web前端知识库](https://github.com/AlloyTeam/Mars) - [Front-End-Develop-Guide 前端开发指南](https://github.com/w3crange/Front-End-Develop-Guide) - [前端开发笔记本](https://li-xinyang.gitbooks.io/frontend-notebook/content/) - [大前端工具集 - 聂微东](https://github.com/nieweidong/fetool) - [前端开发者手册](https://dwqs.gitbooks.io/frontenddevhandbook/content/) - [前端开发者手册](http://www.kancloud.cn/kancloud/front-end-dev-handbook/75919) - [JavaScript 资源大全中文版](https://www.awesomes.cn/) - [Awesomes - 前端资源库](https://github.com/jobbole/awesome-javascript-cn) 二、入门类- [前端入门教程](http://www.cnblogs.com/jikey/p/3613082.html) - [瘳雪峰的Javascript教程](http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000) - [jQuery基础教程](http://www.imooc.com/view/11) - [前端工程师必备的PS技能——切图篇](http://www.imooc.com/view/506) - [结合个人经历总结的前端入门方法](https://github.com/qiu-deqing/FE-learning) 三、效果类- [弹出层](http://www.imooc.com/learn/58) - [焦点图轮播特效](http://www.imooc.com/learn/18) 四、工具类- [css sprite 雪碧图制作](http://www.imooc.com/learn/93) - [版本控制入门 – 搬进 Github](http://www.imooc.com/learn/390) - [Grunt-beginner前端自动化工具](http://www.imooc.com/learn/30) 五、慕课专题- [张鑫旭 - 慕课系列](http://www.imooc.com/u/197450/courses?sort=publish) - [lyn - 慕课系列](http://www.imooc.com/u/104593/courses?sort=publish) - [艾伦 - 慕课系列](http://www.imooc.com/u/290139/courses?sort=publish) - [碧仔 - Hello，移动WEB](http://www.imooc.com/view/494) - [百度FEX技术周刊](http://fex.baidu.com/weekly/) - [平安科技移动开发二队技术周报](https://github.com/PaicHyperionDev/MobileDevWeekly) - [360奇舞周刊](http://www.75team.com/weekly/) 六. API:1. 总目录 开发中心 mozilla js参考 chrome开发中心（chrome的内核已转向blink） safari开发中心 microsoft js参考.aspx) js秘密花园 js秘密花园 w3help 综合Bug集合网站 综合搜索 javascripting 各种流行库搜索 综合API runoob.com-包含各种API集合 开源中国在线API文档合集 devdocs 英文综合API网站 devdocs 中文综合API网站 overapi 英文综合API网站 2. jQuery jQuery API 中文文档 hemin 在线版 css88 jq api css88 jqui api 学习jquery jquery 源码查找 3. Ecmascript Understanding ECMAScript 6 - Nicholas C. Zakas exploring-es6 exploring-es6翻译 exploring-es6翻译后预览 阮一峰 es6 阮一峰 Javascript ECMA-262，第 5 版 es5 4. Js template template-chooser artTemplate tomdjs 淘宝模板juicer模板 Fxtpl v1.0 繁星前端模板引擎 laytpl mozilla - nunjucks Juicer dustjs etpl twitter-tpl 5. 弹出层 artDialog 最新版 artDialog 文档 google code 下载地址 贤心弹出层 响应式用户交互组件库 sweetalert-有css3动画弹出层 6. CSS CSS 语法参考 CSS3动画手册 alloyteam - CSS3 UI 库 腾讯css3动画制作工具 志爷css小工具集合 css3 js 移动大杂烩 bouncejs 触摸库 css3 按钮动画 animate.css 全局CSS的终结(狗带) [译] ANIMATION - 大漠 7. Angularjs Angular.js 的一些学习资源 angularjs中文社区 Angular Style Guide Angularjs源码学习 Angularjs源码学习 angular对bootstrap的封装 angularjs + nodejs 吕大豹 Angularjs AngularJS 最佳实践 Angular的一些扩展指令 Angular数据绑定原理 一些扩展Angular UI组件 Ember和AngularJS的性能测试 带你走近AngularJS - 基本功能介绍 Angularjs开发指南 Angularjs学习 不要带着jQuery的思维去学习AngularJS angularjs 学习笔记 angularjs 开发指南 angularjs 英文资料 angular bootstrap angular jq mobile angular ui 整合jQuery Mobile+AngularJS经验谈 有jQuery背景，该如何用AngularJS编程思想 AngularJS在线教程 angular学习笔记 UI Bootstrap - AngularJS directives specific to Bootstrap NG Bootstrap - Angular 2 directives specific to Bootstrap 4 8. React react海量资源 react.js 中文论坛 react.js 官方网址 react.js 官方文档 react.js material UI react.js TouchstoneJS UI react.js amazeui UI React 入门实例教程 - 阮一峰 React Native 中文版 Webpack 和 React 小书 - 前端乱炖 Webpack 和 React 小书 - gitbook React原创实战视频教程 React 入门教程 react-webpack-starter 基于react组件化开发 React 编程规范(by Airbnb) React Webpack小说 9. 移动端API API 99移动端知识集合 移动端前端开发知识库 移动前端的一些坑和解决方法（外观表现） 【原】移动web资源整理 zepto 1.0 中文手册 zepto 1.0 中文手册 zepto 1.1.2 zepto 中文注释 jqmobile 手册 移动浏览器开发集合 移动开发大杂烩 微信webview中的一些问题 框架 特色的HTML框架可以创建精美的iOS应用 淘宝SUI 10. avalon avalonjs Avalon新一代UI库： OniUI avalon.oniui-基于avalon的组件库 11. Requriejs Javascript模块化编程（一）：模块的写法 Javascript模块化编程（二）：AMD规范 Javascript模块化编程（三）：require.js的用法 RequireJS入门（一） RequireJS入门（二） RequireJS进阶（三） requrie源码学习 requrie 入门指南 requrieJS 学习笔记 requriejs 其一 require backbone结合 12. Seajs seajs seajs 中文手册 13. Less,sass sass sass教程-sass中国 Sass 中文文档 less 14. Markdown Markdown 语法说明 (简体中文版) markdown入门参考 gitbook 国外的在线markdown可编辑成书 mdeditor 一款国内的在线markdown编辑器 stackedit 国外的在线markdown编辑器，功能强大，同步云盘 mditor 一款轻量级的markdown编辑器 lepture-editor markdown-editor Markdown 在线编辑器 15. D3 d3 Tutorials Gallery lofter iteye ruanyifeng 16. 兼容性 esma 兼容列表 W3C CSS验证服务 caniuse csscreator microsoft.aspx) 在线测兼容-移动端 emulators 17. UI相关 bootcss MetroUICSS semantic Buttons kitecss pintuer amazeui worldhello linuxtoy gitmagic rogerdudler gitref book gogojimmy 18. HTTP HTTP API 设计指南 19. 其它API javascript流行库汇总 验证api underscore 中文手册 underscore源码分析 underscore源码分析-亚里士朱德的博客 underscrejs en api lodash - underscore的代替品 ext4api backbone 中文手册 qwrap手册 缓动函数 svg 中文参考 svg mdn参考 svg 导出 canvas svg 导出 png ai-to-svg localStorage 库 20. 图表类 Highcharts 中文API Highcharts 英文API ECharts 百度的图表软件 高德地图 开源的矢量图脚本框架 svg 地图 jQuery Vector Map Library 21. vue Vue Vue 论坛 Vue 入门指南 Vue 的一些资源索引 21. 正则 JS正则表达式元字符 正则表达式30分钟入门教程 MDN-正则表达式 ruanyifeng - RegExp对象 小胡子哥 - 进阶正则表达式 is.js 正则在线测试 22. ionic ionic 23. 其它 Mock.js 是一款模拟数据生成器 jsdoc 注释生成 - apidocjs 七. 开发规范 前端 通过分析github代码库总结出来的工程师代码书写习惯 HTML&amp;CSS编码规范 by @mdo 前端编码规范之js - by yuwenhui 前端编码规范之js - by 李靖 前端开发规范手册 Airbnb JavaScript 编码规范（简体中文版） AMD与CMD规范的区别 AMD与CMD规范的区别 KISSY 源码规范 bt编码规范 规范加强版 前端代码规范 及 最佳实践 百度前端规范 百度前端规范 百度前端规范 ECMAScript6 编码规范–广发证券前端团队 JavaScript 风格指南/编码规范（Airbnb公司版） 网易前端开发规范 css模块 前端规范资源列表 前端JavaScript规范 Nodejs Node.js 风格指南 PHP 最流行的PHP 代码规范 最流行的PHP 代码规范 Android 【敏捷开发】Android团队开发规范 Android 开发规范与应用 八. 其它收集1. 各大公司开源项目 Facebook Facebook Projects 百度 Baidu 百度web前端研发部 百度EFE 百度github 腾讯 qq alloyteam alloyteam-github alloyteam-AlloyGameEngine AlloyDesigner 即时修改，即时保存，设计稿较正，其它开发辅助工具 H5交互页编辑器AEditor介绍 H5动画交互页开发的工具介绍 AEditor H5动画交互页开发的工具 腾讯html5 腾讯开源项目 奇舞团 奇舞团开源项目 去哪儿 Qunar UED 其它 maka 值得订阅的weekly 2. Javascript 常用 ieBetter.js-让IE6-IE8拥有IE9+,Chrome等浏览器特性 模拟键盘 拼音 中国个人身份证号验证 算法 数据结构与算法 JavaScript 描述. 章节练习 常见排序算法（JS版） 经典排序 常见排序算法-js版本 JavaScript 算法与数据结构 精华集 面试常考算法题精讲 移动端 fastclick no-click-delay JSON 模拟生成JSON数据 返回跨域JSONAPI 3. Html5 HTML5 有哪些让你惊艳的 demo？ html5 Canvas画图系列教程目录 4. CSS browserhacks 5. jQuery 焦点图 myfocus myfocus-官方演示站 SuperSlidev2.1 – 大话主席 soChange 6. Ext, EasyUI, J-UI 及其它各种UI方案 Ext extjs ext4英文api ext4中文api EasyUI jquery easyui 未压缩源代码 J-UI J-UI Other MUI-最接近原生APP体验的高性能前端框架 Amaze UI | 中国首个开源 HTML5 跨屏前端框架 淘宝 HTML5 前端框架 KISSY - 阿里前端JavaScript库 网易Nej - Nice Easy Javascript Kendo UI MVVM Demo Bootstrap Smart UI 雅虎UI - CSS UI 7. 页面 社会化 分享功能 百度分享 pc端 JiaThis pc端 社会化分享组件 移动端 ShareSDK 轻松实现社会化功能 移动端 友盟分享 移动端 addthis 国外社交分享 8. 富文本编辑器 百度 ueditor 经典的ckeditor 经典的kindeditor wysiwyg 一个有情怀的编辑器。Bach’s Editor tower用的编辑器 summernote 编辑器 html5编辑器 XEditor wangEditor wangEditor-mobile–移动端编辑器 Trumbowyg - 轻量编辑器 国外的一款编辑器 - tinymce 9. 日历 PC 经典my97 强大的独立日期选择器 fullcalendar fullcalendar日历控件知识点集合 中文api 农历日历 超酷的仿百度带节日日历老黄历控件 日期格式化 大牛日历控件 我群某管理作品 input按位替换-官网 input按位替换-github bootstrap-daterangepicker 国外30个插件集合 JavaScript datepicker Datepair.js 一个风格多样的日历 弹出层式的全日历 jquery双日历 bootstrap-datetimepicker/ 贤心-laydate Pikaday-微型日历 AngularJS datepicker directives 移动 大气实用jQuery手机移动端日历日期选择插件 jQuery Mobile 移动开发中的日期插件Mobiscroll Date library Datejs sugarjs 10. 综合效果搜索平台 效果网 17素材 常用的JavaScript代码片段 11. 前端工程化 概述 前端工具大全 什么是前端工程化 Gulp Gulp官网 Gulp中文网 gulp资料收集 Gulp：任务自动管理工具 - ruanyifeng Gulp插件 Gulp不完全入门教程 为什么使用gulp? Gulp安装及配合组件构建前端开发一体化 Gulp 入门指南 Gulp 入门指南 - nimojs Gulp入门教程 Gulp in Action Gulp开发教程（翻译） 前端构建工具gulpjs的使用介绍及技巧 Grunt gruntjs Grunt中文网 Fis fis 官网 fis webpack webpack Webpack 中文指南 Webpack，101入门体验 webpack入门教程 基于webpack搭建前端工程解决方案探索 Webpack傻瓜式指南（一） Webpack指南 webpack指南 12. 轮播图 pc图轮 单屏轮播sochange 左右按钮多图切换 fullpage全屏轮播 移动端 无缝切换 滑屏效果 全屏fullpage 单个图片切换 单个全屏切换 百度的切换库 单个全屏切换 滑屏效果 旋转拖动设置 类似于swipe切换 支持多种形式的触摸滑动 滑屏效果 大话主席pc移动图片轮换 滑屏效果 基于zepto的fullpage [WebApp]定宽网页设计下，固定宽度布局开发WebApp并实现多终端下WebApp布局自适应 判断微信客户端的那些坑 可以通过javascript直接调用原生分享的工具 JiaThis 分享到微信代码 聊聊移动端跨平台开发的各种技术 前端自动化测试 多种轮换图片 滑动侧边栏 13. 文件上传 百度上传组件 上传 flash 头像上传 图片上传预览 图片裁剪 图片裁剪-shearphoto jQuery图片处理 文件上传 14. 模拟select 糖饼 select flexselect 双select select2 15. 取色插件 类似 Photoshop 的界面取色插件 jquery color 取色插件集合 farbtastic 圆环＋正方形 16. 城市联动 jquery.cityselect.js基于jQuery+JSON的省市或自定义联动效果 17. 剪贴板 剪贴板 clipboard 最新的剪切方案 18. 简繁转换 简繁转换 19. 表格 Grid facebook表格 类似于Excel编辑表格-handsontable bootstrap-table插件 datatables 不错的Grid 20. 在线演示 js 在线编辑 - runjs js 在线编辑 - jsbin js 在线编辑 - codepen js 在线编辑 - jsfiddle phpfiddle java 在线编辑 - ideone js 在线编辑 - hcharts js 在线编辑 - jsdm sql 在线编辑 - sqlfiddle mozilla 在线编辑器 21. 播放器 Html5 VideoPlayer 22. 粒子动画 Proton 烟花 23. 表单验证 Validform formvalidator jQuery formValidator 表单验证完美解决方案 24. 表单美化 美化checkbox 九. Nodejs Node.js 包教不包会 篇幅比较少 node express 入门教程 nodejs定时任务 一个nodejs博客 【NodeJS 学习笔记04】新闻发布系统 过年7天乐，学nodejs 也快乐 七天学会NodeJS Nodejs学习笔记（二）— 事件模块 nodejs入门 angularjs nodejs 从零开始nodejs系列文章 理解nodejs nodejs事件轮询 node入门 nodejs cms Node初学者入门，一本全面的NodeJS教程 NodeJS的代码调试和性能调优 runs Node.js programs through Chromium DevTools 十. 性能优化 常规优化 Javascript高性能动画与页面渲染 移动H5前端性能优化指南 5173首页前端性能优化实践 给网页设计师和前端开发者看的前端性能优化 复杂应用的 CSS 性能分析和优化建议 张鑫旭——前端性能 前端性能监控总结 网站性能优化之CSS无图片技术 web前端性能优化进阶路 前端技术：网站性能优化之CSS无图片技术 浏览器的加载与页面性能优化 页面加载中的图片性能优化 Hey——前端性能 html优化 99css——性能 Yslow——性能优化 YSLOW中文介绍 转一篇Yahoo关于网站性能优化的文章，兼谈本站要做的优化 Yahoo!团队实践分享：网站性能 网站性能优化指南：什么使我们的网站变慢？ 网站性能优化实践，减少加载时间，提高用户体验 浅谈网站性能优化 前端篇 前端重构实践之如何对网站性能优化？ 前端性能优化：使用媒体查询加载指定大小的背景图片 网站性能系列博文 加载，不只是少一点点 前端性能的测试与优化 分享网页加载速度优化的一些技巧？ 页面加载中的图片性能优化 web前端优化(基于Yslow) 网站性能优化工具大全 【高性能前端1】高性能HTML 【高性能前端2】高性能CSS 由12306谈谈网站前端性能和后端性能优化 AlloyTeam——前端优化 毫秒必争，前端网页性能最佳实践 网站性能工具Yslow的使用方法 前端工程与性能优化（上）：静态资源版本更新与缓存 前端工程与性能优化（下）：静态资源管理与模板框架 HTTPS连接的前几毫秒发生了什么 Yslow Essential Web Performance Metrics — A Primer, Part 1 Essential Web Performance Metrics — Part 2 YUISlide,针对移动设备的动画性能优化 Improving Site Performance 让网站提速的最佳前端实践 Why Website Speed is Important Need for Speed – How to Improve your Website Performance 阿里无线前端性能优化指南 (Pt.1 加载期优化) 优化工具 JavaScript 性能分析新工具 OneProfile JavaScript 堆内存分析新工具 OneHeap 在线工具 google在线工具 阿里测 阿里-免费测试服务 阿里-F2etest多浏览器兼容性测试解决方案 js性能测试 轻松玩转PDF 十一. 前端架构 技术架构 前端架构 如何成为前端架构师 关于前端架构-张克军 百度腾讯offer比较（腾讯游戏VS百度基础架构） 十二. 个人作品1. 推荐作品 winter代码片段需要翻墙 fgm 岑安作品集 当耐特demo集合 米空格 js作品 myFocus SeaJS组件库 颜海镜作品 脚儿网作品 javascript个人作品 妙味的雷东升游戏作品 javascript作品集 云五笔，灰度产生生成工具 项目主页 个性的作品主页 ucren js demos 集 智能社 实例陈列架 zoye demo 王员外 平凡 jyg 游戏案例 很多jquery插件 不羁虫 - soJs 作品系列 frozenui 黑白棋 fromone 2. 群员作品 MDialog - [合肥-M.J] 轮播图 - [上海－冷静] [广州—坚壳] [成都 - 无痕] 感恩节专题 [球霸天] [北京-小数] [ptf] Magix 工具 [杭州-Pft] Magix 基于 MVC 结构和 Hash 驱动的 OPOA（One Page One Application）应用 [上海-剧中人]-实验室 [上海-豪情 ] 作品集合 [成都-feeling] [上海-angela] [海南-hank]作品 [上海-张力]博客 [上海-zenki]作品 移动端图案解锁 [合肥-M.J] - MPreview 移动端图片预览组 [合肥-M.J] - Mexam 移动端在线做题组 [北京-苏瑞] - dancer小人 [上海-玄沐]- 个人网站 [厦门-二哲]- 个人博客 3. 国外大牛精品 pazguille 十三. 简历 生成 MarkDown在线简历工具 MarkDown在线简历工具 模板 不错的个人简历 简历 张伦 简历 翁天信 动画方式的简历 组件丰富简历 简历池 haorooms博客 Justin Young 各个程序员简历模板 十四. 面试题 那几个月在找工作（百度，网易游戏） 名企笔试大全 2016校招内推 – 阿里巴巴前端 – 三面面试经历 年后跳槽那点事：乐视+金山+360面试之行 拉勾网js面试题 前端面试 前端开发面试题 百度面试 前端工作面试问题 前端开发面试题 5个经典的前端面试问题 如何面试一名前端开发工程师？ 前端实习生面试总结 史上最全 前端开发面试问题及答案整理 BAT及各大互联网公司2014前端笔试面试题：JavaScript篇 前端开发面试题大收集 收集的前端面试题和答案 如何面试前端工程师 前端开发面试题 牛客网-笔试面经 Front End Developer Questions 40 个重要的 HTML5 面试问题及答案 十五. iconfont 中文字体 淘宝字库 字体 制作教程 zhangxinxu-icommon icommon 用字体在网页中画ICON图标(推荐教程) 字体压缩工具 感谢初级群 [深圳-小鱼] 的推荐 十六. 开发工具类 前端开发工具 IntelliJ IDEA 简体中文专题教程 Webstorm,InterllIdea,Phpstorm SublimeText Atom Atom飞行手册（中文版） Atom-vue代码高亮 visual studio code visual studio code 使用指南 Chrome, Firebug, Filddle 调试 Fiddler Fiddler调式使用知多少(一)深入研究 微信fiddle 微信fiddle Chrome Google Chrome 官方 Chrome - 基础 Chrome - 进阶 Chrome - 性能 Chrome - 性能进阶 Chrome - 移动 Chrome - 使用技巧 Chrome - Console控制台不完全指南 Chrome - Workspace使浏览器变成IDE network面板 chrome开发工具快捷键 chrome调试工具常用功能整理 Chrome 开发工具 Workspace 使用 Chrome神器Vimium快捷键学习记录 sass调试-w3cplus 如何更专业的使用Chrome开发者工具-w3cplus chrome调试canvas chrome profiles1 chrome profiles2 chrome profiles3 chrome移动版调试 chrome调试 chrome的调试 chrome console 命令详解 查看事件绑定1 查看事件绑定2 神器——Chrome开发者工具(一) 奇趣百科性能优化(Chrome DevTools 中的 Timeline Profils 等工具使用介绍) chrome 开发者工具的 15 个小技巧 Chrome开发者工具不完全指南 Chrome 开发者工具使用技巧 Chrome渲染分析之Rendering工具使用(1) Chrome渲染分析之Rendering工具使用(2) Chrome渲染分析之Rendering工具使用(3) 像 Sublime Text 一样使用 Chrome DevTools Chorme 35个开发者工具的小技巧 Firebug firebug视频教程 firefox 模拟器 console.log 命令详解 Firebug入门指南 Firebug控制台详解 移动,微信调试 微信调试的那些事 微信调试官网 微信公众号本地调试 微信、手Q、Qzone之x5内核inspect调试解决方案 浏览器端调试安卓 移动端前端开发调试 使用 Chrome 远程调试 Android 设备 mac移动端调试 mac移动端调试 无线调试攻略 无线调试攻略 屌爆了,完美调试 微信webview(x5) 远程console 微信调试工具 各种真机远程调试方法汇总 手机测试自己写的web页面 iOS Simulator Simulator Xcode中的iOS模拟器(iOS Simulator)的介绍和使用心得 img loading img 智图-图片优化平台 在线png优化 生成二维码 生成二维码 浏览器同步 puer liveReload f5 File Watchers 在线PPT制作 nodePPT PPT reveal slippy 十七. 前端导航网站 前端导航 前端网址导航 前端名录 前端导航 前端开发资源 前端开发仓库 - 众多效果的收集地 前端资源导航 F2E 前端导航 前端收藏夹 前端导航 前端工具箱 前端人俱乐部-灵感_Idea 十八. 常用CDN 新浪CDN 百度静态资源公共库 360网站卫士常用前端公共库CDN服务 Bootstrap中文网开源项目免费 CDN 服务 开放静态文件 CDN - 七牛 CDN加速 - jq22 jQuery CDN Google jQuery CDN 微软CDN 十九. Git,SVN,Github Git git-scm 廖雪峰-Git教程 git-for-windows GitHub 添加 SSH keys gogithub git常规命令练习 git的资料整理 我所记录的git命令（非常实用） 企业开发git工作流模式探索部分休整 GitHub 漫游指南 GitHub秘籍 使用git和github进行协同开发流程 动画方式练习git 版本管理工具介绍—Git篇 版本控制入门 – 搬进 Github Git动画演示 SVN 版本管理工具介绍—SVN篇","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"资源汇总","slug":"资源汇总","permalink":"http://lolee.cn/tags/资源汇总/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"Awesome PHP","slug":"PHP资源","date":"2016-12-21T11:31:18.000Z","updated":"2019-04-29T11:12:17.428Z","comments":true,"path":"2016/12/21/PHP资源/","link":"","permalink":"http://lolee.cn/2016/12/21/PHP资源/","excerpt":"一个PHP资源列表，内容包括：库、框架、模板、安全、代码分析、日志、第三方库、配置工具、Web 工具、书籍、电子书、经典博文等等 贡献详细内容请查看贡献 和 代码管理. 目录 Awesome PHP","text":"一个PHP资源列表，内容包括：库、框架、模板、安全、代码分析、日志、第三方库、配置工具、Web 工具、书籍、电子书、经典博文等等 贡献详细内容请查看贡献 和 代码管理. 目录 Awesome PHP 依赖管理 Dependency Management 其他的依赖管理 Dependency Management Extras 框架 Frameworks 其他框架 Framework Extras 框架组件 Components 微型框架 Micro Frameworks 其他微型框架 Micro Framework Extras 路由 Routers 模板 Templating 静态站点生成器 Static Site Generators HTTP 中间件 Middlewares URL Email - [文件 Files](#文件-files) - [流 Streams](#流-streams) - [依赖注入 Dependency Injection](#依赖注入-dependency-injection) - [图像 Imagery](#图像-imagery) - [测试 Testing](#测试-testing) - [持续集成 Continuous Integration](#持续集成-continuous-integration) - [文档 Documentation](#文档-documentation) - [安全 Security](#安全-security) - [密码 Passwords](#密码-passwords) - [代码分析 Code Analysis](#代码分析-code-analysis) - [Architectural](#architectural) - [调试和分析 Debugging and Profiling](#调试和分析-debugging-and-profiling) - [构建工具 Build Tools](#构建工具-build-tools) - [任务运行器 Task Runners](#任务运行器-task-runners) - [导航 Navigation](#导航-navigation) - [资源管理 Asset Management](#资源管理-asset-management) - [地理位置 Geolocation](#地理位置-geolocation) - [日期和时间 Date and Time](#日期和时间-date-and-time) - [事件 Event](#事件-event) - [日志 Logging](#日志-logging) - [电子商务 E-commerce](#电子商务-e-commerce) - [PDF](#pdf) - [Office](#office) - [数据库 Database](#数据库-database) - [迁移 Migrations](#迁移-migrations) - [NoSQL](#nosql) - [队列 Queue](#队列-queue) - [搜索 Search](#搜索-search) - [命令行 Command Line](#命令行-command-line) - [身份验证和授权 Authentication and Authorization](#身份验证和授权-authentication-and-authorization) - [标记 Markup](#标记-markup) - [字符串 Strings](#字符串-strings) - [数字 Numbers](#数字-numbers) - [过滤和验证 Filtering and Validation](#过滤和验证-filtering-and-validation) - [API](#api) - [缓存 Caching](#缓存-caching) - [数据结构和存储 Data Structure and Storage](#数据结构和存储-data-structure-and-storage) - [通知 Notifications](#通知-notifications) - [部署 Deployment](#部署-deployment) - [国际化和本地化 Internationalisation and Localisation](#国际化和本地化-internationalisation-and-localisation) - [第三方API Third Party APIs](#第三方api-third-party-apis) - [扩展 Extensions](#扩展-extensions) - [杂项 Miscellaneous](#杂项-miscellaneous) 软件 Software PHP安装 PHP Installation 开发环境 Development Environment 虚拟机 Virtual Machines 集成开发环境(IDE) Integrated Development Environment Web应用 Web Applications 基础架构 Infrastructure 资源 Resources PHP网站 PHP Websites 其他网站 Other Websites PHP书籍 PHP Books 其他书籍 Other Books PHP视频 PHP Videos PHP阅读 PHP Reading PHP内核阅读 PHP Internals Reading PHP杂志 PHP Magazines 贡献 依赖管理 Dependency Management依赖和包管理库 Climb - 一个Composer版本管理工具 Composer Installers - 一个多框架Composer库安装器 Composer/Packagist - 一个包和依赖管理器 Melody - 一个用于构建Composer脚本文件的工具 Pickle - 一个PHP扩展安装器 其他的依赖管理 Dependency Management Extras其他的相关依赖管理 Composer Checker - 一个校验Composer配置的工具 Composer Merge Plugin - 一个用于合并多个composer.json文件的Composer插件 Composition - 一个在运行时检查Composer环境的库 NameSpacer - 一个转化下划线到命名空间的库 Patch Installer - 一个使用Composer安装补丁的库 Prestissimo - 一个开启并行安装进程的Composer插件 Satis - 一个静态Composer存储库的生成器 Toran Proxy - 一个静态Composer存储库和代理 框架 FrameworksWeb开发框架 Aura PHP - 一个独立的组件框架 CakePHP - 一个快速应用程序开发框架 (CP) Laravel 5 - 另一个PHP框架 (L5) Nette - 另一个由个体组件组成的框架 Phalcon - 通过C扩展实现的框架 PPI Framework 2 - 一个互操作性框架 Symfony 2 - 一个独立组件组成的框架 (SF2) Yii2 - 另一个PHP框架 Zend Framework 2 - 另一个由独立组件组成的框架 (ZF2) 其他框架 Framework Extras其他Web开发框架 CakePHP CRUD - CakePHP的快速应用程序（RAD）插件 Knp RAD Bundle - Symfony 2的快速应用程序（RAD）包 Symfony CMF - 一个创建自定义CMS的内容管理框架 框架组件 Components来自web开发框架的独立组件 CakePHP Plugins - CakePHP插件的目录 Hoa Project - 另一个PHP组件包 League of Extraordinary Packages - 一个PHP软件开发组 Symfony2 Components - Symfony 2组件 Zend Framework 2 Components - Zend Framework 2组件 微型框架 Micro Frameworks微型框架和路由 Bullet PHP - 用于构建REST APIs的微型框架 Lumen - 一个Laravel的微型框架 Proton - 一个StackPHP兼容的微型框架 Silex - 基于Symfony2组件的微型框架 Slim - 另一个简单的微型框架 其他微型框架 Micro Framework Extras其他相关的微型框架和路由 Silex Skeleton - Silex的项目架构 Silex Web Profiler - 一个Silex web的调试工具 Slim Skeleton - Slim架构 Slim View - Slim自定义视图的集合 路由 Routers处理应用路由的库 Fast Route - 一个快速路由的库 Klein - 一个灵活的路由的库 Pux - 另一个快速路由的库 Route - 一个基于Fast Route的路由的库 模板 Templating模板化和词法分析的库和工具 Foil - 另一个原生PHP模板库 Lex - 一个轻量级模板解析器 MtHaml - 一个HAML模板语言的PHP实现 Mustache - 一个Mustache模板语言的PHP实现 Phly Mustache - 另一个Mustache模板语言的PHP实现 PHPTAL - 一个TAL模板语言的PHP实现 Plates - 一个原生PHP模板库 Smarty - 一个模板引擎 Twig - 一个全面的模板语言 静态站点生成器 Static Site Generators用来生成web页面的预处理内容的工具 Couscous - 一个将Markdown转化为漂亮的网站的工具 Phrozn - 另一个转换Textile，Markdown和Twig为HTML的工具 Sculpin - 转换Markdown和Twig为静态HTML的工具 Spress - 一个能够将Markdown和Twig转化为HTML的可扩展工具 HTTP用于HTTP的库 Buzz - 另一个HTTP客户端 Guzzle - 一个全面的HTTP客户端 HTTPFul - 一个链式HTTP库 PHP VCR - 一个录制和重放HTTP请求的库 Requests - 一个简单的HTTP库 Retrofit - 一个能轻松创建REST API客户端的库 Scraping用于网站爬取的库 Embed - 一个从web服务或网页中提取的信息的工具 Goutte - 一个简单的web爬取器 PHP Spider - 一个可配置和可扩展的PHP web爬虫 中间件 Middlewares使用中间件构建应用程序的库 PSR7-Middlewares - 灵感来源于方便的中间件 Relay - 一个PHP 5.5 PSR-7的中间件调度器 Slim Middleware - 一个用于Slim的自定义的中间件的集合 Stack - 一个用于Silex/Symfony的可堆叠的中间件的库 zend-stratigility - 基于PHP PSR-7之上的中间件之上 URL解析URL的库 Purl - 一个URL处理库 Uri - 另一个URL处理库 PHP Domain Parser - 一个本地前缀解析库 sabre/uri - 一个URI操作库 Email发送和解析邮件的库 SwiftMailer - 一个邮件解决方案 PHPMailer - 另一个邮件解决方案 Fetch - 一个IMAP库 Email Reply Parser - 一个邮件回复解析的库 Stampie - 一个邮件服务库，类似于SendGrid,PostMark,MailGun和Mandrill. CssToInlineStyles - 一个在邮件模板中的内联CSS库 Email Validator - 一个较小的电子邮件验证库 Mautic - 邮件营销自动化 文件 Files文件处理和MIME类型检测的库 Apache MIME Types - 一个解析Apache MIME类型的库 Canal - 一个检测互联网媒体类型的库 CSV - 一个CSV数据处理库 Ferret - 一个MIME检测库 Flysystem - 另一个文件系统抽象层 Gaufrette - 一个文件系统抽象层 Hoa Mime - 另一个MIME检测库 Lurker - 一个资源跟踪库 PHP FFmpeg - 一个用于FFmpeg视频包装的库 流 Streams处理流的库 Streamer - 一个简单的面向对象的流包装库 依赖注入 Dependency Injection实现依赖注入设计模式的库 Pimple - 一个小的依赖注入容器 Auryn - 一个递归的依赖注入容器 Container - 另一个可伸缩的依赖注入容器 PHP-DI - 一个支持自动装配和PHP配置的依赖注入容器 Acclimate - 一个依赖注入容器和服务定位的通用接口 Symfony DI - 一个依赖注入容器组件 (SF2) 图像 Imagery处理图像的库 Imagine - 一个图像处理库 PHP Image Workshop - 另一个图像处理库 Intervention Image - 另一个图像处理库 GIF Frame Extractor - 一个提取GIF动画帧信息的库 GIF Creator - 一个通过多张图片创建GIF动画的库 Image With Text - 一个在图像中嵌入文本的库 Color Extractor - 一个从图像中提取颜色的库 Glide - 一个按需处理图像的库 Image Optimizer - 一个优化图像的库 Image Hash - 一个用于生成图像哈希感知的库 测试 Testing测试代码和生成测试数据的库 PHPUnit - 一个单元测试框架 DBUnit - 一个PHPUnit的数据库测试库 ParaTest - 一个PHPUnit的并行测试库 PHPSpec - 一个基于功能点设计的单元测试库 Codeception - 一个全栈测试框架 AspectMock - 一个PHPUnit/Codeception的模拟框架。 Atoum - 一个简单的测试库 Mockery - 一个用于测试的模拟对象的库 Phake - 另一个用于测试的模拟对象的库 Prophecy - 一个可选度很高的模拟框架 Faker - 一个伪数据生成库 Samsui - 另一个伪数据生成库 Alice - 富有表现力的一代库 Behat - 一个行为驱动开发（BDD）测试框架 Pho - 另一个行为驱动开发测试框架 Mink - Web验收测试 HTTP Mock - 一个在单元测试模拟HTTP请求的库 VFS Stream - 一个用于测试的虚拟文件系统流的包装器 VFS - 另一个用于测试虚拟的文件系统 Locust - 一个用Python编写的现代加载测试库 Peridot - 一个事件驱动开发的测试框架 Kahlan - 全栈Unit/BDD测试框架，内置stub，mock和代码覆盖率的支持 持续集成 Continuous Integration持续集成的库和应用 Travis CI - 一个持续集成平台 SemaphoreCI - 一个开放源码和私人项目的持续集成平台 PHPCI - 一个PHP的开源的持续集成平台 Sismo - 一个持续测试的服务库 Jenkins - 一个PHP支持的持续集成平台 JoliCi - 一个用PHP编写的由Docker支持的持续集成的客户端 GitlabCi - 使用GitLab CI测试、构建、部署你的代码，像TravisCI 文档 Documentation生成项目文档的库 Sami - 一个API文档生成器 APIGen - 另一个API文档生成器 PHP Documentor 2 - 一个API文档生成器 phpDox - 一个PHP项目的文档生成器（不限于API文档） daux.io - 一个使用Markdown文件的文档生成器 安全 Security生成安全的随机数，加密数据，扫描漏洞的库 Halite - 一个简单的使用libsodium的加密库 HTML Purifier - 一个兼容标准的HTML过滤器 IniScan - 一个扫描PHP INI文件安全的库 Optimus - 基于Knuth乘法散列方法的身份混淆工具 PHP Encryption - 一个安全的PHP加密库 PHP IDS - 一个结构化的PHP安全层 PHP SSH - 一个试验的面向对象的SSH包装库 PHPSecLib - 一个纯PHP安全通信库 RandomLib - 一个生成随机数和字符串的库 SecurityMultiTool - 一个PHP安全库 SensioLabs Security Check - 一个为检查Composer依赖提供安全建议的web工具 TCrypto - 一个简单的键值加密存储库 True Random - 使用www.random.org生成随机数的库 VAddy - 一个持续安全的web应用测试平台 Zed - 一个集成的web应用渗透测试工具 密码 Passwords处理和存储密码的库和工具 GenPhrase - 一个随机生成安全密码哈希的库 Password Compat - 一个新的PHP5.5密码函数的兼容库 Password Policy - 一个PHP和JavaScript的密码策略库 Password Validator - 一个校验和升级密码哈希的库 Password-Generator - 一个生成随机密码的PHP库 PHP Password Lib - 一个生成和校验密码的库 phpass - 一个便携式的密码哈希框架 Zxcvbn PHP - 一个基于Zxcvbn JS的现实的PHP密码强度估计库 代码分析 Code Analysis分析，解析和处理代码库的库和工具 PHP Parser - 一个PHP编写的PHP解析器 PHPPHP - 一个PHP实现的PHP虚拟机 PHPSandbox - 一个PHP沙盒环境 Dissect - 一个词法和语法分析的工具集合 PHP Mess Detector - 一个扫描代码缺陷，次优代码，未使用的参数等等的库。 PHP Code Sniffer - 一个检测PHP、CSS和JS代码标准冲突的库 PHPCPD - 一个检测复制和粘贴代码的库 PHP Analyser - 一个分析PHP代码查找缺陷和错误的库 PHP CS Fixer - 一个编码标准库 PHP Manipulator - 一个分析和修改PHP源代码的库 PHP Metrics - 一个静态测量库 PHP Refactoring Browser - 一个重构PHP代码的命令行工具集 PHP Semantic Versioning Checker - 一个比较两个源集和确定适当的应用语义版本的命令行实用程序 UBench - 一个简单的微型基准检测库 Athletic - 一个基于注释的基准检测库 Mondrian - 使用图论的代码分析工具 Scrutinizer - 一个审查PHP代码的web工具 PHPLOC - 一个快速测量PHP项目大小的工具 PHPCheckstyle - 一个帮助遵守特定的编码惯例的工具 PhpDependencyAnalysis - 一个创建可定制依赖图的工具 Code Climate - 一个自动代码审查工具 Architectural相关的设计模式库，组织代码编程的方法和途径 PHP Option - 一个可选的类型库 Ruler - 一个简单的无状态的生产环境规则引擎 Finite - 一个简单的PHP有限状态机 Compose - 一个功能组合库 Monad PHP - 一个简单Monad库 Patchwork - 一个重新定义用户的函数库 Galapagos - 语言转换进化 Design Patterns PHP - 一个使用PHP实现的设计模式存储库 Functional PHP - 一个函数式编程库 Iter - 一个使用生成器提供迭代原语的库 Pipeline - 一个管道模式的实现 调试和分析 Debugging and Profiling调试和分析代码的库和工具 APM - 一个收集SQLite/MySQL/StatsD错误信息和统计信息的监控扩展 Barbushin PHP Console - 另一个使用Google Chrome的web调试控制台 Blackfire.io - 一个低开销的代码分析器 Kint - 一个调试和分析工具 PHP Console - 一个web调试控制台 PHP Debug Bar - 一个调试工具栏 PHPBench - 一个基准测试框架 PHPDBG - 一个交互的PHP调试器 Tracy - A一个简单的错误检测，写日志和时间测量库 xDebug - 一个调试和分析PHP的工具 xHprof - 另一个PHP分析工具 Z-Ray - 一个调试和配置Zend服务器的工具 构建工具 Build Tools项目构建和自动化工具 Bob - 一个简单的项目自动化工具 Phake - 一个PHP克隆库 Box - 一个构建PHAR文件的工具 Phing - 一个灵感来自于Apache Ant的PHP项目构建系统 任务运行器 Task Runners自动运行任务的库 Task - 一个灵感来源于Grunt和Gulp的纯PHP任务运行器 Robo - 一个面向对象配置的PHP任务运行器 Bldr - 一个构建在Symfony组件上的PHP任务运行器 Jobby - 一个没有修改crontab的PHP定时任务管理器 导航 Navigation构建导航结构的工具 KnpMenu - 一个菜单库 Cartographer - 一个站点地图生成库 资源管理 Asset Management管理，压缩和最小化web站点资源的工具 Assetic - 一个资源管理的管道库 Pipe - 另一个资源管理的管道库 Munee - 一个资源优化库 JShrink - 一个JavaScript的最小化库 Puli - 一个检测资源绝对路径的库 地理位置 Geolocation地理编码地址和使用纬度经度的库 GeoCoder - 一个地理编码库 GeoTools - 一个地理工具相关的库 PHPGeo - 一个简单的地理库 GeoJSON - 一个GeoJSON的实现 日期和时间 Date and Time处理日期和时间的库 Carbon - 一个简单的日期时间API扩展 ExpressiveDate - 另一个日期时间API扩展 CalendR - 一个日历管理库 事件 Event时间驱动或实现非阻塞事件循环的库 React - 一个事件驱动的非阻塞I/O库. Rx.PHP - 一个reactive扩展库 Ratchet - 一个web socket库 Hoa WebSocket - 另一个web socket库 Hoa EventSource - 一个事件源库 Evenement - 一个事件调度的库 Event - 一个专注于域名事件的库 Cake Event - 一个事件调度的库 (CP) Broadway - 一个事件源和CQRS(命令查询责任分离)库 Prooph Event Store - 一个持久化事件消息的事件源组件 Hprose-PHP - 一个很牛的RPC库，现在支持25+种语言 日志 Logging生成和处理日志文件的库 Monolog - 一个全面的日志工具 KLogger - 一个易用的兼容PSR-3的日志类 Analog - 一个基于闭包的微型日志包 电子商务 E-commerce处理支付和构建在线电子商务商店的库和应用 Money - 一个Fowler金钱模式的PHP实现 OmniPay - 一个框架混合了多网关支付处理的库 Payum - 一个支付抽象库 Sebastian Money - 另一个处理货币值的库 Shopware - 一个可高度定制的电子商务软件 Swap - 一个汇率库 Sylius - 一个开源的电子商务解决方案 Thelia - 另一个开源的电子商务解决方案 PDF处理PDF文件的库和软件 Dompdf - 一个将HTML转换为PDF的工具 PHPPdf - 一个将XML文件转换为PDF和图片的库 Snappy - 一个PDF和图像生成器库 WKHTMLToPDF - 一个将HTML转换为PDF的工具 OfficeLibraries for working with office suite documents. ExcelAnt - 一个操作Excel文档的库 PHPExcel - 一个处理Excel文档的库 PHPPowerPoint - 一个处理PPT文档的库 PHPWord - 一个处理Word文档的库 数据库 Database使用对象关系映射（ORM）或数据映射技术的数据库交互的库 Baum - 一个Eloquent的嵌套集实现 Cake ORM - 对象关系映射工具，利用DataMapper模式实现 (CP) Doctrine Extensions - 一个Doctrine行为扩展的集合 Doctrine - 一个全面的DBAL和ORM Eloquent - 一个简单的ORM(L5) LazyRecord - 一个简单、可扩展、高性能的ORM Pomm - 一个PostgreSQL对象模型管理器 Propel - 一个快速的ORM，迁移库和查询构架器 ProxyManager - 一个为数据映射生成代理对象的工具集 RedBean - 一个轻量级，低配置的ORM Spot2 - 一个MySQL的ORM映射器 迁移 Migrations帮助管理数据库模式和迁移的库 PHPMig - 另一个迁移管理库 Phinx - 另一个数据库迁移的管理库 Migrations - 一个迁移管理库 Doctrine Migrations - 一个Doctrine的迁移库 Ruckusing - 基于PHP下ActiveRecord的数据库迁移，支持MySQL, Postgres, SQLite NoSQL处理NoSQL后端的库 Monga - 一个MongoDB抽象库 MongoQB - 一个MongoDB查询构建库 PHPMongo - 一个MongoDB ORM. Predis - 一个功能完整的Redis库 队列 Queue处理事件和任务队列的库 Bernard - 一个多后端抽象库 Pheanstalk - 一个Beanstalkd客户端库 PHP AMQP - 一个纯PHP AMQP库 Thumper - 一个RabbitMQ模式库 搜索 Search在数据上索引和执行查询的库和软件 Elastica - ElasticSearch的客户端库 ElasticSearch PHP - ElasticSearch的官方客户端库 Solarium - Solr的客户端库 Sphinx Search - Sphinx搜索库，提供SphinxQL索引和搜索的功能 SphinxQL query builder - Sphinx搜索引擎的的查询库 命令行 Command Line关于命令行工具的库 Boris - 一个微型PHP REPL PsySH - 另一个PHP REPL Pecan - 一个事件驱动和非阻塞的shell GetOpt - 一个命令行选择解析器 OptParse - 另一个命令行选择解析器 Commando - 另一个简单的命令行选择解析器 GetOptionKit - 另一个命令行选择解析器 Cron Expression - 一个计算cron运行日期的库 ShellWrap - -一个简单的命令行包装库 Hoa Console - 另一个命令行库 Shunt - 一个在多台远程机器上并行运行命令行的库 Cilex - 一个构建命令行工具的微型框架 CLImate - 一个输出带颜色的和特殊格式的命令行库 CLI Menu - 一个构建CLI菜单的库 CLIFramework - 一个支持完全zsh／bash、子命令和选项约束的命令行框架，这也归功于phpbrew 身份验证和授权 Authentication and Authorization实现身份验证和授权的库 Sentinel - 一个混合的身份验证和授权的框架库 Sentinel Social - 一个社交网络身份验证库 Opauth - 一个多渠道的身份验证框架 OAuth2 Server - 一个OAuth2身份验证服务，资源服务器和客户端库 OAuth2 Server - 另一个OAuth2服务器实现 PHP oAuthLib - 另一个OAuth库 TwitterOAuth - 一个Twitter OAuth库 TwitterSDK - 一个完全测试的Twitter SDK Hawk - 一个Hawk HTTP身份认证库 HybridAuth - 一个开源的社交登陆库 Lock - 一种实现访问控制列表（ACL）系统的库 OAuth 1.0 Client - 一个OAuth 1.0客户端的库 OAuth 2.0 Client - 一个OAuth 2.0客户端的库 标记 Markup处理标记的库 Decoda - 一个轻量级标记解析库 PHP Markdown - 一个Markdown解析器 CommonMark PHP - 一个对CommonMark spec全支持的Markdown解析器 Parsedown - 另一个Markdown解析器 Ciconia - 另一个支持Github Markdown风格的Markdown解析器 Cebe Markdown - 一个快速的可扩展的Markdown解析器 HTML to Markdown - 将HTML转化为Markdown HTML5 PHP - 一个HTML5解析和序列化库 Emoji - 一个把Unicode字符和名称转换为表情符号图片的库 字符串 Strings解析和处理字符串的库 Agent - 一个基于Mobiledetect的桌面／手机端user agent解析库 ANSI to HTML5 - 一个将ANSI转化为HTML5的库 Color Jizz - 处理和转换颜色的库 Device Detector - 另一个解析user agent字符串的库 Hoa String - 另一个UTF-8字符串库 Mobile-Detect - 一个用于检测移动设备的轻量级PHP类(包括平板电脑) Patchwork UTF-8 - 一个处理UTF-8字符串的便携库 Slugify - 转换字符串到slug的库 SQL Formatter - 一个格式化SQL语句的库 Stringy - 一个多字节支持的字符串处理库 Text - 一个文本处理库 UA Parser - 一个解析user agent字符串的库 URLify - 一个Django中URLify.js的PHP版本 UUID - 生成UUIDs的库 数字 Numbers处理数字的库 Numbers PHP - 一个处理数字的库 Math - 一个处理巨大数字的库 ByteUnits - 一个在二进制和度量系统中解析,格式化和转换字节单元的库 PHP Units of Measure - 一个计量单位转换的库 PHP Conversion -另一个计量单位转换的库 LibPhoneNumber for PHP - 一个Google电话号码处理的PHP实现库 过滤和验证 Filtering and Validation过滤和验证数据的库 Cake Validation - 另一个验证库 (CP) DMS Filter - 一个注释过滤库 Filterus - 一个简单的PHP过滤库 ISO-codes - 一个验证各种ISO和ZIP编码的库(IBAN, SWIFT/BIC, BBAN, VAT, SSN, UKNIN) MetaYaml - 一个支持YAML,JSON和XML的模式验证库 Respect Validation - 一个简单的验证库 Upload - 一个处理文件上传和验证的库 Valitron - 另一个验证库 Volan - 另一个简单的验证库 API开发REST-ful API的库和web工具 API Platform - 暴露出REST API的项目，包含JSON-LD, Hydra格式 Apigility - 一个使用Zend Framework 2构建的API构建器 Drest - 一个将Doctrine实体暴露为REST资源节点的库 HAL - 一个超文本应用语言(HAL)构建库 Hateoas - 一个HOATEOAS REST web服务库 Negotiation - 一个内容协商库 Restler - 一个将PHP方法暴露为RESTful web API的轻量级框架 wsdl2phpgenerator - 一个从SOAP WSDL文件生成PHP类的工具 缓存 Caching缓存数据的库 Alternative PHP Cache (APC) - 打开PHP操作码缓存 APIx Cache - 一个轻量级的PSR-6缓存 CacheTool - 一个使用命令行清除apc/opcode缓存的工具 Cake Cache - 一个缓存库 (CP) Doctrine Cache - 一个缓存库 Stash - 另一个缓存库 Zend Cache - 另一个缓存库 (ZF2) 数据结构和存储 Data Structure and Storage实现数据结构和存储技术的库 Ardent - 一个数据结构库 Cake Collection - 一个简单的集合库 (CP) Collections - 一个PHP的集合抽象库 Fractal - 一个转换复杂数据结构到JSON输出的库 Ginq - 另一个基于.NET实现的PHP的LINQ库 JsonMapper - 一个将内嵌JSON结构映射为PHP类的库 PHP Collections - 一个简单的集合库 PINQ - 一个基于.NET实现的PHP的LINQ(Language Integrated Query)库 Serializer - 一个序列化和反序列化数据的库 Totem - -一个管理和创建数据交换集的库 YaLinqo - 另一个PHP的LINQ库 Zend Serializer - 另一个序列化和反序列化数据的库 (ZF2) 通知 Notifications处理通知软件的库 JoliNotif - 一个跨平台的桌面通知库(支持Growl, notify-send, toaster等) Nod - 一个通知库(Growl等) Notification Pusher - 一个设备推送通知的独立库 Notificato - 一个处理推送通知的库 Notificator - 一个轻量级的通知库 部署 Deployment项目部署库 Pomander - 一个PHP应用部署工具 Rocketeer - PHP世界里的一个快速简单的部署器 Envoy - 一个用PHP运行SSH任务的工具 Plum - 一个部署库 Deployer - 一个部署工具 国际化和本地化 Internationalisation and Localisation国际化(I18n)和本地化(L10n)的库 Aura Intl Cake I18n - 消息国际化和日期和数字的本地化 (CP) 第三方API Third Party APIs访问第三方API的库 Amazon Web Service SDK - PHP AWS SDK官方库 S3 Stream Wrapper - Amazon S3流包装库 Stripe - Stripe官方PHP库 Campaign Monitor - Campaign Monitor官方PHP库 Digital Ocean - Digital Ocean API接口库 Github - 一个Github API交互库 PHP Github API - 另一个Github API交互库 Twitter OAuth - 一个Twitter OAuth工作流交互库 Twitter REST - 一个Twitter REST API交互库 Dropbox SDK - Dropbox SDK官方PHP库 Twilio - Twilio官方PHP REST API Mailgun - Mailgun官方PHP REST API 扩展 Extensions帮助构建PHP扩展的库 Zephir - 用于开发PHP扩展，且介于PHP和C++之间的编译语言 PHP CPP - 一个开发PHP扩展的C++库 杂项 Miscellaneous不在上面分类中的有用库和工具 Spork - 一个处理forking的库 JSON Lint - 一个JSON lint工具 JSONPCallbackValidator - 验证JSONP回调的库 Pagerfanta - 一个分页库 LiteCQRS - 一个CQRS(命令查询责任分离)库 Chief - 一个命令总线库 Sslurp - 一个使得SSL处理减少的库 Metrics - 一个简单的度量API库 sabre/vobject - 一个解析VCard和iCalendar对象的库 Annotations - 一个注释库(Doctrine的一部分) Whoops - 一个不错的错误处理库 LadyBug - 一个dumper库 Symfony VarDumper - 一个dumper库(SF2) Procrastinator - 一个运行耗时任务的库 SuperClosure - 一个允许闭包序列化的库 Jumper - 一个远程服务执行库 Underscore - 一个Undersccore JS库的PHP实现 PHP PassBook - 一个iOS PassBook PHP库 PHP Expression - 一个PHP表达式语言 RMT - 一个编写版本和发布软件的库 Opengraph - 一个开放图库 Essence -一个提取web媒体的库 Embera - 一个Oembed消费库 Graphviz - 一个图形库 Flux - 一个正则表达式构建库 PHPCR - 一个Java内容存储库(JCR)的PHP实现 ClassPreloader - 一个优化自动加载的库 PHPStack - 一个PHP编写的TCP/IP栈概念 Nmap - 一个Nmap PHP包装器 Lambda PHP - 一个PHP中的Lambda计算解析器 Country List - 所有带有名称和ISO 3166-1编码的国家列表 PHP-GPIO - 一个用于Raspberry PI的GPIO pin的库 print_o - 一个对象图的可视化器 Alias - 一个类别名库 Cake Utility - 工具类如Inflector，字符串，哈希，安全和XML (CP) Slimdump - 一个简单的MySQL dumper工具 Prooph Service Bus - 轻量级的消息总线，支持CQRS和微服务 软件 Software创建一个开发环境的软件 PHP安装 PHP Installation在你的电脑上帮助安装和管理PHP的工具 HomeBrew - 一个OSX包管理器 HomeBrew PHP - 一个HomeBrew的PHP通道 PHP OSX - 一个OSX下的PHP安装器 PHP Brew - 一个PHP版本管理和安装器 PHP Env - 另一个PHP版本管理器 PHP Switch - 另一个PHP版本管理器 PHP Build - 另一个PHP版本安装器 VirtPHP - 一个创建和管理独立PHP环境的工具 开发环境 Development Environment创建沙盒开发环境的软件和工具 Vagrant - 一个便携的开发环境工具 Ansible - 一个非常简单的编制框架 Puppet - 一个服务器自动化框架和应用 PuPHPet - 一个构建PHP开发虚拟机的web工具 Protobox - 另一个构建PHP开发虚拟机的web工具 Phansible - 一个用Ansible构建PHP开发虚拟机的web工具 虚拟机 Virtual Machines相关的PHP虚拟机 HHVM - Facebook出品的PHP虚拟机，Runtime和JIT HippyVM - 另一个PHP虚拟机 Hack - 一个PHP进行无缝操作的HHVM编程语言 集成开发环境(IDE) Integrated Development Environment支持PHP的集成开发环境 Netbeans - 一个支持PHP和HTML5的IDE Eclipse for PHP Developers - 一个基于Eclipse平台的PHP IDE PhpStorm - 一个商业PHP IDE Web应用 Web Applications基于Web的应用和工具 3V4L - 一个在线的PHP和HHVM shell DBV - 一个数据库版本控制应用 PHP Queue - A一个管理后端队列的应用 MailCatcher - 一个抓取和查看邮件的web工具 Cachet - 开源状态页面系统 phpRedisAdmin - 一个用于管理Redis数据库的简单web界面 phpPgAdmin - 一个PostgreSQL的web管理工具 phpMyAdmin - 一个MySQL/MariaDB的web界面 Adminer - 一个数据库管理工具 Grav - 一个现代的flat－file的CMS 基础架构 Infrastructure提供PHP应用和服务的基础架构 appserver.io - 一个用PHP写的多线程的PHP应用服务器 php-pm - 一个PHP应用的进程管理器、修改器和负载平衡器 资源 Resources各种提高你的PHP开发技能和知识的资源，比如书籍，网站，文章 PHP网站 PHP WebsitesPHP相关的有用的网站 PHP The Right Way - 一个PHP最佳实践的快速指引手册 PHP Best Practices - 一个PHP最佳实践指南 PHP Weekly - 一个PHP新闻周刊 Securing PHP - 一个关于PHP安全和库的建议的简报 PHP Security - 一个PHP安全指南 PHP FIG - PHP框架交互组 PHP UG - 一个帮助用户定位最近的PHP用户组(UG)的网站 Seven PHP - 一个PHP社区成员采访的网站 Nomad PHP - 一个在线PHP学习资源 PHP School - 学习PHP的开源资源 PHP Mentoring - 点对点PHP导师组织 PHPTrends - 一个快速增长的PHP类库的概述 PHP Versions - 哪些版本的PHP可以用在哪几种流行的Web主机上的列表 其他网站 Other Websitesweb开发相关的有用网站 The Open Web Application Security Project (OWASP) - 一个开放软件安全社区 WebSec IO - 一个web安全社区资源 Semantic Versioning - 一个解析语义版本的网站 Atlassian Git Tutorials - 一个Git教程系列 Hg Init - 一个Mercurial教程系列 Servers for Hackers - 一个关于服务器管理的新闻通讯 PHP书籍 PHP BooksPHP相关的非常好的书籍 PHP 7 Upgrade Guide - 一本Colin O’Dell的包含所有PHP 7功能和改变的书 PHP Pandas - 一本Dayle Rees关于如何学习写PHP的书 Scaling PHP Applications - 一本Steve Corona关于扩展PHP应用程序的电子书 The Grumpy Programmer’s Guide to Building Testable PHP Applications - 一本Chris Hartjes关于构建PHP应用程序测试的书 Grumpy PHPUnit - 一本Chris Hartjes关于使用PHPUnit进行单元测试的书 Mastering Object-Orientated PHP - 一本Brandon Savage关于PHP面向对象的书 Signaling PHP - 一本Cal Evans关于在CLI脚本捕获PCNTL信号的书 Securing PHP: Core Concepts - 一本Chris Cornutt关于PHP常见安全条款和实践的书 Modernising Legacy Applications in PHP - 一本Paul M.Jones关于遗留PHP应用进行现代化的书 Modern PHP New Features and Good Practices - 一本Josh Lockhart关于新的PHP功能和最佳做法的书 Functional Programming in PHP - 这本书将告诉你如何利用PHP5.3+的新功能的认识函数式编程的原则 其他书籍 Other Books与一般计算和web开发相关的书 The Linux Command Line - William Shotts关于Linux命令行的一本书 Understanding Computation - Tom Stuart关于计算理论的一本书 The Tangled Web — Securing Web Applications - Michal Zalewski关于web应用安全的一本书 Elasticsearch: The Definitive Guide - Clinton Cormley和Zachary Tong编写的与Elasticsearch工作的一本指南 Eloquent JavaScript - Marijin Haverbeke关于JavaScript编程的一本书 Vagrant Cookbook - Erika Heidi关于创建 Vagrant环境的一本书 Pro Git - Scott Chacon和Ben Straub关于Git的一本书 Head First Design Patterns - 解说软件设计模式的一本书 PHP视频 PHP VideosPHP相关的非常不错的视频 Taking PHP Seriously - 来自Facebook Keith Adams 讲述PHP优势 PHP Town Hall - 一个随意的Ben Edmunds和Phil Sturgeon的PHP播客 Programming with Anthony - Anthony Ferrara的视频系列 PHP UK Conference - 一个PHP英国会议的视频集合 PHP阅读 PHP ReadingPHP相关的阅读资料 Create Your Own PHP Framework - 一部Fabien Potencier的关于如何创建你自己的PHP框架的系列文章 Seven Ways to Screw Up BCrypt - 一篇关于纠正BCrypt实现的文章 Preventing CSRF Attacks - 一篇阻止CSRF攻击的文章 Don’t Worry About BREACH - 一篇关于BREACH攻击和CSRF令牌的文章 On PHP 5.3, Lambda Functions and Closures - 一篇关于lambda函数和闭包的文章 Use Env - 一篇关于使用unix环境帮助的文章 Composer Primer - Composer初级使用 Composer Versioning - 一篇关于Composer版本的文章 Composer Stability Flags - 一篇关于Composer稳定性标志的文章 PHP Sucks! But I Like It! - 一篇关于PHP利弊的文章 PHP Is Much Better Than You Think - 一篇关于PHP语言和生态圈的文章 PHP内核阅读 PHP Internals Reading阅读PHP内核或性能相关的资料 PHP RFCs - PHP RFCs主页(请求注解) PHP Internals Book - 一本由三名核心开发编写的关于PHP内核的在线书 Print vs Echo, Which One is Faster? - 一篇关于打印和echo性能的文章 The PHP Ternary Operator. Fast or Not? - 一篇关于三元操作性能的文章 Disproving the Single Quotes Myth - 一篇关于单，双引号字符串性能的文章 You’re Being Lied To - 一篇关于内核ZVALs的文章 How Long is a Piece of String - 一篇关于字符串原理的文章 Understanding OpCodes - 一篇关于opcodes的文章 How Foreach Works - StackOverflow关于foreach回答的详情 When Does Foreach Copy? - 一篇关于foreach原理的文章 How Big Are PHP Arrays (And Values) Really? - 一篇关于数组原理的文章 Why Objects (Usually) Use Less Memory Than Arrays - 一篇关于对象和数组原理的文章 PHP Evaluation Order - 一篇关于PHP评估顺序的文章 开发人员的PHP源代码: 1 2 3 4 - 关于PHP源代码的系列 垃圾收集: 1 2 3 - 关于PHP垃圾收集原理的系列 PHP杂志 PHP Magazines有趣的PHP相关的杂志 php[architect] - 一个致力于PHP的月更的杂志","categories":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}],"tags":[{"name":"PHP","slug":"PHP","permalink":"http://lolee.cn/tags/PHP/"}],"keywords":[{"name":"后端","slug":"后端","permalink":"http://lolee.cn/categories/后端/"}]},{"title":"全栈成长指南","slug":"全栈增长工程师指南","date":"2016-12-21T11:31:18.000Z","updated":"2019-04-29T05:19:35.934Z","comments":true,"path":"2016/12/21/全栈增长工程师指南/","link":"","permalink":"http://lolee.cn/2016/12/21/全栈增长工程师指南/","excerpt":"Growth: 全栈增长工程师指南简介我们都会学习，但是有时候我们只是不知道应该学习什么而已。 这是一本指导性的书籍——不要指望从这本书中学到所有的知识点，但是他可以帮助你构建你的知识体系。 这也是其他技术书籍所欠缺的。它可以告诉你，你可以学习什么，然后看什么书。","text":"Growth: 全栈增长工程师指南简介我们都会学习，但是有时候我们只是不知道应该学习什么而已。 这是一本指导性的书籍——不要指望从这本书中学到所有的知识点，但是他可以帮助你构建你的知识体系。 这也是其他技术书籍所欠缺的。它可以告诉你，你可以学习什么，然后看什么书。对于有些人来说，成为全栈是因为：来自社会的各个不同的中小公司，只靠一个领域的知识难以生存对于有些人来说，成为全栈是因为：这个世界有太多的乐趣，在一颗树上吊死太可惜了。对于有些人来说，成为全栈是因为：他们想去创业。 而人们对于全栈有太多的误解——认为全栈应该什么都会，什么都精通。全栈只是因为我们对系统有整体性的认识，而不是精通整个系统。因为专家只精通某一个领域，总得有一个架构师来对系统把握。 我更愿意去改称这本书为《增长工程师指南》，去避免对这本书的误解。但是我想要去改变人们的观点，全栈更侧重于知识体系的增长。因为人们对于专家还有一个印象：古板。 我的其他电子书： 《一步步搭建物联网系统》 《GitHub 漫游指南》 《RePractise》 在线预览：http://growth.phodal.com/ 下载: GitHub直接下载：Epub版、Mobi版、PDF版、RTF版 百度盘：http://pan.baidu.com/s/1qYuy5Bm Growth实战篇 Django版: Growth In Action Django 目录 Growth: 全栈增长工程师指南 全栈工程师是未来 技术的革新史 软件开发的核心难题：沟通 大公司的专家与小公司的全栈 全栈工程师的未来：无栈 基础知识篇 工具只是辅助 WebStorm 还是 Sublime? 语言也是一种工具 提高效率的工具 快速启动软件 IDE DEBUG 工具 终端或命令提示符 包管理 环境搭建 OS X Windows GNU/Linux 学好一门语言的艺术 一次语言学习体验 输出是最好的输入 如何应用一门新的技术 Web 编程基础 从浏览器到服务器 从 HTML 到页面显示 HTML hello,world 中文？ 其他 HTML 标记 小结 CSS 简介 样式与目标 选择器 更有趣的 CSS JavaScript hello,world JavaScriptFul 面向对象 其他 前端与后台 后台语言选择 JavaScript Python Java PHP 其他 MVC Model View Controller 更多 后台即服务 API 演进史 后台即服务 数据持久化 文件存储 数据库 搜索引擎 前端框架选择 Angular React Vue jQuery 系 前台与后台交互 Ajax JSON WebSocket 编码 编码过程 Web 应用的构建系统 Web 应用的构建过程 Web 应用的构建实战 Git 与版本控制 版本控制 Git Tasking 如何 Tasking 一本书 Tasking 开发任务 写代码只是在码字 内置索引与外置引擎 门户网站 内置索引与外置引擎 如何编写测试 测试金字塔 如何测试 测试替身 Stub Mock 测试驱动开发 红-绿-重构 测试先行 可读的代码 命名 函数长度 其他 代码重构 重命名 提取变量 提炼函数 Intellij Idea 重构 提炼函数 内联函数 查询取代临时变量 重构到设计模式 过度设计与设计模式 上线 隔离与运行环境 隔离硬件：虚拟机 隔离操作系统：容器虚拟化 隔离底层：Servlet 容器 隔离依赖版本：虚拟环境 隔离运行环境：语言虚拟机 隔离语言：DSL LNMP 架构 GNU/Linux HTTP 服务器 Web 缓存 数据库端缓存 应用层缓存 前端缓存 客户端缓存 HTML5 离线缓存 可配置 环境配置 运行机制 功能开关 自动化部署 依赖与包仓库 构建软件包 上传和安装软件包 数据分析 构建-衡量-学习 想法-构建 产品-衡量 数据-学习 数据分析 识别需求 收集数据 分析数据 展示数据 用户数据分析：Google Analytics 受众群体 流量获取 移动应用 网站性能 网站性能监测 网站性能 SEO 爬虫与索引 什么样的网站需要 SEO？ SEO 基础知识 内容 UX 入门 什么是 UX 什么是简单？ 进阶 用户体验要素 认知设计 流 持续交付 持续集成 持续集成系统 持续集成流程 持续交付 基础设施 持续部署 持续学习 持续阅读 持续编程 持续写作 遗留系统与修改代码 遗留代码 遗留代码 如何修改遗留代码 修改遗留代码 网站重构 速度优化 功能加强 模块重构 回顾与架构设计 自我总结 吾日三省吾身 Retro Retro 的过程 三个维度 架构模式 预设计式架构 演进式架构：拥抱变化 浮现式设计 意图导向 重构 模式与演进 每个人都是架构师 如何构建一个博客系统 相关阅读资料 架构解耦 从 MVC 与微服务 CQRS CQRS 结合微服务 Contributors aidewoode Evan Lau loveisbug wangcongyi wangyufeng0615","categories":[],"tags":[{"name":"资源汇总","slug":"资源汇总","permalink":"http://lolee.cn/tags/资源汇总/"},{"name":"Book","slug":"Book","permalink":"http://lolee.cn/tags/Book/"},{"name":"教程","slug":"教程","permalink":"http://lolee.cn/tags/教程/"}],"keywords":[]},{"title":"前端 JS 脚本","slug":"前端 JS 脚本","date":"2016-12-20T11:21:18.000Z","updated":"2019-04-29T11:14:18.806Z","comments":true,"path":"2016/12/20/前端 JS 脚本/","link":"","permalink":"http://lolee.cn/2016/12/20/前端 JS 脚本/","excerpt":"以下是常用的代码收集，没有任何技术含量，只是填坑的积累。 1. PC - js 返回指定范围的随机数(m-n之间)的公式 1Math.random()*(n-m)+m return false return false","text":"以下是常用的代码收集，没有任何技术含量，只是填坑的积累。 1. PC - js 返回指定范围的随机数(m-n之间)的公式 1Math.random()*(n-m)+m return false return false 12345678910111213141516// event.preventDefault()会阻挡预设要发生的事件.// event.stopPropagation()会阻挡发生冒泡事件.// 而return false则是前面两者的事情他都会做：// 他会做event.preventDefault();// 他会做event.stopPropagation();// 停止callback function的执行并且立即return回来``` - 防止被Iframe嵌套```javascriptif(top != self)&#123; location.href = ”about:blank”;&#125; 两种图片lazy加载的方式第一个By JS中级交流群 成都-猎巫 第二个By 上海-zenki 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475767778798081828384858687888990919293949596979899100101102103104105106107108109110111112113114115116117118// @description 准备为图片预加载使用的插件// 使用的图片容器css类名为lazy-load-wrap// 图片真实地址为data-lazy-src// 当lazy-load-wrap容器进入视口，则开始替换容器内所有需要延迟加载的图片路径，并更改容器的加载状态//第一种方法$.fn.compassLazyLoad=function()&#123; var _HEIGHT=window.innerHeight, _lazyLoadWrap=$('.lazy-load-wrap'); var methods=&#123; setOffsetTop:function()&#123; $.each(_lazyLoadWrap,function(i,n)&#123; $(n).attr(&#123; 'top':n.offsetTop-_HEIGHT, 'status':'wait' &#125;); &#125;) &#125;, isShow:function()&#123; var _scrollTop=$(window).scrollTop; //利用image容器判断是否进入视口，而非image本身 $.each(_lazyLoadWrap,function()&#123; var _that=$(this); if (_that.attr('status')==='done') &#123; return; &#125;; if (_that.attr('top')&lt;=_scrollTop) &#123; _that.find('img[data-lazy-src]').each(function(i,n)&#123; n.src=$(n).data('lazy-src'); &#125;); _that.attr('status','done'); &#125;; &#125;) &#125;, scroll:function()&#123; $(window).on('scroll',function()&#123; methods.isShow(); &#125;); &#125;, init:function()&#123; methods.setOffsetTop(); methods.isShow(); methods.scroll(); &#125; &#125;; methods.init();&#125;//第二种方法var exist=(function($)&#123; var timer=null, temp=[].slice.call($('.container')); ret=&#123;&#125;; for(var i=0,len=temp.length-1;i&lt;=len;i++)&#123; ret[i]=temp[i]; &#125; var isExist=function(winTop,winEnd)&#123; for(var i in ret)&#123; console.log(ret); var item=ret[i], eleTop=item.offsetTop, eleEnd=eleTop+item.offsetHeight; if((eleTop&gt;winTop&amp;&amp;eleTop&lt;=winEnd)||(eleEnd&gt;winTop&amp;&amp;eleEnd&lt;=winEnd))&#123; $(item).css('background','none'); new Tab($(item).attr('id'),data).init; delete ret[i]; &#125; &#125; &#125; return &#123; timer:timer; isExist:isExist; &#125;;&#125;)($);//第三种方法Zepto(function ($) &#123; var swiper = new Swiper('.swiper-container', &#123; pagination: '.swiper-pagination', paginationClickable: true, autoplay: 3000, loop: true, autoplayDisableOnInteraction: false &#125;); (function lazyLoad() &#123; var imgs = $(\".lazyLoad\"); var src = ''; $.each(imgs, function (index, item) &#123; src = $(item).attr('data-src'); $(item).attr('src', src); &#125;); &#125;)();&#125;);$(function () &#123; var lazyLoadTimerId = null; /// 智能加载事件 $(window).bind(\"scroll\", function () &#123; clearTimeout(lazyLoadTimerId); lazyLoadTimerId = setTimeout(function () &#123; // 延迟加载所有图片 var isHttp = (location.protocol === \"http:\"); $(\"#ym_images img\").each(function () &#123; var self = $(this); if (self.filter(\":above-the-fold\").length &gt; 0) &#123; var originUrl = self.attr(\"data-original\"); self.attr(\"src\", originUrl); &#125; &#125;); &#125;, 500); &#125;);&#125;); 某年某月的1号为星期几 12var weekday = [\"星期日\", \"星期一\", \"星期二\", \"星期三\", \"星期四\", \"星期五\", \"星期六\"];weekday[new Date(2015, 9, 1).getDay()]; //2015年10月1号 2. Mobile - js js 判断IOS, 安卓12345var u = navigator.userAgent, app = navigator.appVersion;var isAndroid = u.indexOf('Android') &gt; -1 || u.indexOf('Linux') &gt; -1; //android终端或者uc浏览器var isiOS = !!u.match(/\\(i[^;]+;( U;)? CPU.+Mac OS X/); //ios终端alert('是否是Android：'+isAndroid);alert('是否是iOS：'+isiOS); 3. 微信 weixin UserAgent 判断微信客户端 12345// Mozilla/5.0 (iPhone; CPU iPhone OS 8_3 like Mac OS X) AppleWebKit/600.1.4 (KHTML, like Gecko) Mobile/12F70 MicroMessenger/6.1.5 NetType/WIFIfunction isWechat() &#123; var ua = navigator.userAgent.toLowerCase(); return /micromessenger/i.test(ua) || /windows phone/i.test(ua);&#125; JS接口安全域名不填写，分享onMenuShareAppMessage直接会取默认值。 1// 分享onMenuShareAppMessage直接会取默认值 关闭当前页面 1WeixinJSBridge.call('closeWindow'); 支付接口方法调用必须在addevent里边调用 123document.addEventListener('WeixinJSBridgeReady', function onBridgeReady()&#123; that.initOrder();&#125;, false); 支付接口方法调用必须在 123456789101112WeixinJSBridge.invoke('getBrandWCPayRequest', d, function(res)&#123; if(res.err_msg == \"get_brand_wcpay_request:ok\")&#123; // alert(\"支付成功\"); // union.release(d.orderId); resetUrl(); paySuccess('home', d.orderId); &#125; else &#123; cancelOrder(d.orderId); // alert(res.err_msg); &#125; loading.hide();&#125;); 瀑布流无限加载实例 12345678910111213141516171819202122232425262728293031323334353637383940414243444546474849505152535455565758596061// be dependent on jquery &amp; jquery.infinitescroll.min.js// insert this '&lt;div id=\"more\"&gt;&lt;a href=\"api?page=\"&gt;&lt;/a&gt;&lt;/div&gt;' to your page.html(function($)&#123; $(function()&#123; var $container = $('.list-wrap-gd'); function layOutCallBack() &#123; $container.imagesLoaded(function()&#123; $container.masonry(&#123; itemSelector: '.item-bar', gutter: 10 &#125;); &#125;); $container.imagesLoaded().progress( function() &#123; $container.masonry('layout'); &#125;); &#125; layOutCallBack(); $container.infinitescroll(&#123; navSelector : \"#more\", nextSelector : \"#more a\", itemSelector : \".item-bar\", pixelsFromNavToBottom: 300, loading:&#123; img: \"/images/masonry_loading.gif\", msgText: ' ', finishedMsg: \"&lt;em&gt;已经到最后一页&lt;/em&gt;\", finished: function()&#123; $(\"#more\").remove(); $(\"#infscr-loading\").hide(); &#125; &#125;, errorCallback:function()&#123; $(window).unbind('.infscr'); &#125;, pathParse: function (path, nextPage) &#123; var query = \"\"; var keyword=$(\"#search_keyword\").val(); var cat_id=$(\"#cat_id\").val(); var brand_id=$(\"#brand_id\").val(); var country_id = $(\"#country_id\").val(); query = query + \"&amp;namekeyword=\"+keyword; query = query +\"&amp;cat_id=\"+cat_id query = query + \"&amp;brand_id=\" + brand_id; query = query + \"&amp;country_id=\" + country_id; path = [path,query]; return path; &#125; &#125;, function(newElements) &#123; var $newElems = $( newElements ).css(&#123; opacity: 0 &#125;); $newElems.imagesLoaded(function()&#123; $newElems.animate(&#123; opacity: 1 &#125;); $container.masonry( 'appended', $newElems, true ); layOutCallBack(); &#125;); &#125;); &#125;);&#125;)(jQuery); iOS，Safari浏览器，input等表单focus后fixed元素错位问题123456789101112131415if( /iPhone|iPod|iPad/i.test(navigator.userAgent) ) &#123; $(document).on('focus', 'input, textarea', function() &#123; $('header').css(\"position\", 'absolute'); $('footer').css(\"position\", 'absolute'); &#125;); $(document).on('blur', 'input, textarea', function() &#123; $('header').css(\"position\", 'fixed'); $('footer').css(\"position\", 'fixed'); &#125;);&#125; 得到地理位置 123456789101112function getLocation(callback)&#123; if(navigator.geolocation)&#123; navigator.geolocation.getCurrentPosition( function(p)&#123; callback(p.coords.latitude, p.coords.longitude); &#125;, function(e)&#123; var msg = e.code + \"\\n\" + e.message; &#125; ); &#125;&#125; rem计算适配 12345678910111213(function(doc, win)&#123; var docEl = doc.documentElement, resizeEvt = 'orientationchange' in window ? 'orientationchange' : 'resize', recalc = function()&#123; var clientWidth = docEl.clientWidth; if(!clientWidth) return; docEl.style.fontSize = 20 * (clientWidth / 320) + 'px'; &#125;; if(!doc.addEventListener) return; win.addEventListener(resizeEvt, recalc, false); doc.addEventListener('DOMContentLoaded', recalc, false);&#125;)(document, window); 另外一种rem方案 1234567891011121314151617181920212223242526272829303132var dpr, rem, scale;var docEl = document.documentElement;var fontEl = document.createElement('style');var metaEl = document.querySelector('meta[name=\"viewport\"]');dpr = window.devicePixelRatio || 1;rem = docEl.clientWidth * 2 / 10;scale = 1 / dpr;// 设置viewport，进行缩放，达到高清效果metaEl.setAttribute('content', 'width=' + dpr * docEl.clientWidth + ',initial-scale=' + scale + ',maximum-scale=' + scale + ', minimum-scale=' + scale + ',user-scalable=no');// 设置data-dpr属性，留作的css hack之用docEl.setAttribute('data-dpr', dpr);// 动态写入样式docEl.firstElementChild.appendChild(fontEl);fontEl.innerHTML = 'html&#123;font-size:' + rem + 'px!important;&#125;';// 给js调用的，某一dpr下rem和px之间的转换函数window.rem2px = function(v) &#123; v = parseFloat(v); return v * rem;&#125;;window.px2rem = function(v) &#123; v = parseFloat(v); return v / rem;&#125;;window.dpr = dpr;window.rem = rem; 获取js所在路径 12345678910111213function getJsDir (src) &#123; var script = null; if (src) &#123; script = [].filter.call(document.scripts, function (v) &#123; return v.src.indexOf(src) !== -1; &#125;)[0]; &#125; else &#123; script = document.scripts[document.scripts.length - 1]; &#125; return script ? script.src.substr(0, script.src.lastIndexOf('/')) : script;&#125; 从全局捕获错误 12345678910111213window.onerror = function (errMsg, scriptURI, lineNumber, columnNumber, errorObj) &#123; setTimeout(function () &#123; var rst = &#123; \"错误信息：\": errMsg, \"出错文件：\": scriptURI, \"出错行号：\": lineNumber, \"出错列号：\": columnNumber, \"错误详情：\": errorObj &#125;; alert(JSON.stringify(rst, null, 10)); &#125;);&#125;; 如何通过 js 修改微信浏览器的title? 1234567var $body = $('body');document.title = 'title'; // hack在微信等webview中无法修改document.title的情况 var $iframe = $('&lt;iframe src=\"/favicon.ico\"&gt;&lt;/iframe&gt;').on('load', function()&#123; setTimeout(function()&#123; $iframe.off('load').remove() &#125;, 0) &#125;).appendTo($body) 1. 常用方法 - js 字符串长度截取 1234567891011121314151617181920function cutstr(str, len) &#123; var temp, icount = 0, patrn = /[^\\x00-\\xff]/， strre = \"\"; for (var i = 0; i &lt; str.length; i++) &#123; if (icount &lt; len - 1) &#123; temp = str.substr(i, 1); if (patrn.exec(temp) == null) &#123; icount = icount + 1 &#125; else &#123; icount = icount + 2 &#125; strre += temp &#125; else &#123; break; &#125; &#125; return strre + \"...\"&#125; 替换全部 1234String.prototype.replaceAll = function(s1, s2) &#123; return this.replace(new RegExp(s1, \"gm\"), s2)&#125;` 清除空格 1234String.prototype.trim = function() &#123; var reExtraSpace = /^\\s*(.*?)\\s+$/; return this.replace(reExtraSpace, \"$1\")&#125; 清除左空格/右空格 12function ltrim(s)&#123; return s.replace( /^(\\s*| *)/, \"\"); &#125; function rtrim(s)&#123; return s.replace( /(\\s*| *)$/, \"\"); &#125; 判断是否以某个字符串开头 123String.prototype.startWith = function (s) &#123; return this.indexOf(s) == 0&#125; 判断是否以某个字符串结束 1234String.prototype.endWith = function (s) &#123; var d = this.length - s.length; return (d &gt;= 0 &amp;&amp; this.lastIndexOf(s) == d)&#125; 转义html标签 123function HtmlEncode(text) &#123; return text.replace(/&amp;/g, '&amp;').replace(/\\\"/g, '\"').replace(/&lt;/g, '&lt;').replace(/&gt;/g, '&gt;')&#125; 时间日期格式转换 123456789101112131415161718Date.prototype.Format = function(formatStr) &#123; var str = formatStr; var Week = ['日', '一', '二', '三', '四', '五', '六']; str = str.replace(/yyyy|YYYY/, this.getFullYear()); str = str.replace(/yy|YY/, (this.getYear() % 100) &gt; 9 ? (this.getYear() % 100).toString() : '0' + (this.getYear() % 100)); str = str.replace(/MM/, (this.getMonth() + 1) &gt; 9 ? (this.getMonth() + 1).toString() : '0' + (this.getMonth() + 1)); str = str.replace(/M/g, (this.getMonth() + 1)); str = str.replace(/w|W/g, Week[this.getDay()]); str = str.replace(/dd|DD/, this.getDate() &gt; 9 ? this.getDate().toString() : '0' + this.getDate()); str = str.replace(/d|D/g, this.getDate()); str = str.replace(/hh|HH/, this.getHours() &gt; 9 ? this.getHours().toString() : '0' + this.getHours()); str = str.replace(/h|H/g, this.getHours()); str = str.replace(/mm/, this.getMinutes() &gt; 9 ? this.getMinutes().toString() : '0' + this.getMinutes()); str = str.replace(/m/g, this.getMinutes()); str = str.replace(/ss|SS/, this.getSeconds() &gt; 9 ? this.getSeconds().toString() : '0' + this.getSeconds()); str = str.replace(/s|S/g, this.getSeconds()); return str&#125; 判断是否为数字类型 12345678function isDigit(value) &#123; var patrn = /^[0-9]*$/; if (patrn.exec(value) == null || value == \"\") &#123; return false &#125; else &#123; return true &#125;&#125; 设置cookie值 123456789function setCookie(name, value, Hours) &#123; var d = new Date(); var offset = 8; var utc = d.getTime() + (d.getTimezoneOffset() * 60000); var nd = utc + (3600000 * offset); var exp = new Date(nd); exp.setTime(exp.getTime() + Hours * 60 * 60 * 1000); document.cookie = name + \"=\" + escape(value) + \";path=/;expires=\" + exp.toGMTString() + \";domain=360doc.com;\"&#125; 获取cookie值 12345function getCookie(name) &#123; var arr = document.cookie.match(new RegExp(\"(^| )\" + name + \"=([^;]*)(;|$)\")); if (arr != null) return unescape(arr[2]); return null&#125; 加载样式文件表 123456789101112function LoadStyle(url) &#123; try &#123; document.createStyleSheet(url) &#125; catch(e) &#123; var cssLink = document.createElement('link'); cssLink.rel = 'stylesheet'; cssLink.type = 'text/css'; cssLink.href = url; var head = document.getElementsByTagName('head')[0]; head.appendChild(cssLink) &#125;&#125; 返回脚本内容 123456789101112131415161718function evalscript(s) &#123; if(s.indexOf('&lt;script') == -1) return s; var p = /&lt;script[^\\&gt;]*?&gt;([^\\x00]*?)&lt;\\/script&gt;/ig; var arr = []; while(arr = p.exec(s)) &#123; var p1 = /&lt;script[^\\&gt;]*?src=\\\"([^\\&gt;]*?)\\\"[^\\&gt;]*?(reload=\\\"1\\\")?(?:charset=\\\"([\\w\\-]+?)\\\")?&gt;&lt;\\/script&gt;/i; var arr1 = []; arr1 = p1.exec(arr[0]); if(arr1) &#123; appendscript(arr1[1], '', arr1[2], arr1[3]); &#125; else &#123; p1 = /&lt;script(.*?)&gt;([^\\x00]+?)&lt;\\/script&gt;/i; arr1 = p1.exec(arr[0]); appendscript('', arr1[2], arr1[1].indexOf('reload=') != -1); &#125; &#125; return s;&#125; 清除脚本内容 123function stripscript(s) &#123; return s.replace(/&lt;script.*?&gt;.*?&lt;\\/script&gt;/ig, '');&#125; 动态加载脚本文件 1234567891011121314151617181920212223242526272829303132function appendscript(src, text, reload, charset) &#123; var id = hash(src + text); if(!reload &amp;&amp; in_array(id, evalscripts)) return; if(reload &amp;&amp; $(id)) &#123; $(id).parentNode.removeChild($(id)); &#125; evalscripts.push(id); var scriptNode = document.createElement(\"script\"); scriptNode.type = \"text/javascript\"; scriptNode.id = id; scriptNode.charset = charset ? charset : (BROWSER.firefox ? document.characterSet : document.charset); try &#123; if(src) &#123; scriptNode.src = src; scriptNode.onloadDone = false; scriptNode.onload = function () &#123; scriptNode.onloadDone = true; JSLOADED[src] = 1; &#125;; scriptNode.onreadystatechange = function () &#123; if((scriptNode.readyState == 'loaded' || scriptNode.readyState == 'complete') &amp;&amp; !scriptNode.onloadDone) &#123; scriptNode.onloadDone = true; JSLOADED[src] = 1; &#125; &#125;; &#125; else if(text)&#123; scriptNode.text = text; &#125; document.getElementsByTagName('head')[0].appendChild(scriptNode); &#125; catch(e) &#123;&#125;&#125; 返回按ID检索的元素对象 123function $(id) &#123; return !id ? null : document.getElementById(id);&#125; 检验URL链接是否有效 12345678910111213141516171819function getUrlState(URL)&#123; var xmlhttp = new ActiveXObject(\"microsoft.xmlhttp\"); xmlhttp.Open(\"GET\",URL, false); try&#123; xmlhttp.Send(); &#125;catch(e)&#123; &#125;finally&#123; var result = xmlhttp.responseText; if(result)&#123; if(xmlhttp.Status==200)&#123; return(true); &#125;else&#123; return(false); &#125; &#125;else&#123; return(false); &#125; &#125;&#125; 获取当前路径 123456var currentPageUrl = \"\";if (typeof this.href === \"undefined\") &#123; currentPageUrl = document.location.toString().toLowerCase();&#125;else &#123; currentPageUrl = this.href.toString().toLowerCase();&#125; 获取页面高度 123456function getPageHeight()&#123; var g = document, a = g.body, f = g.documentElement, d = g.compatMode == \"BackCompat\" ? a : g.documentElement; return Math.max(f.scrollHeight, a.scrollHeight, d.clientHeight);&#125; 获取页面可视宽度 12345function getPageViewWidth()&#123; var d = document, a = d.compatMode == \"BackCompat\" ? d.body: d.documentElement; return a.clientWidth;&#125; 获取页面宽度 12345function getPageWidth()&#123; var g = document, a = g.body, f = g.documentElement, d = g.compatMode == \"BackCompat\"? a: g.documentElement; return Math.max(f.scrollWidth, a.scrollWidth, d.clientWidth);&#125; 随机数时间戳 1234function uniqueId()&#123; var a=Math.random,b=parseInt; return Number(new Date()).toString()+b(10*a())+b(10*a())+b(10*a());&#125; 日期格式化函数 1234567891011121314151617181920Date.prototype.format = function(format)&#123; var o = &#123; \"M+\" : this.getMonth()+1, //month \"d+\" : this.getDate(), //day \"h+\" : this.getHours(), //hour \"m+\" : this.getMinutes(), //minute \"s+\" : this.getSeconds(), //second \"q+\" : Math.floor((this.getMonth()+3)/3), //quarter \"S\" : this.getMilliseconds() //millisecond &#125;; if(/(y+)/.test(format)) format=format.replace(RegExp.$1,(this.getFullYear()+\"\").substr(4 - RegExp.$1.length)); for(var k in o)&#123; if(new RegExp(\"(\"+ k +\")\").test(format)) format = format.replace(RegExp.$1,RegExp.$1.length==1 ? o[k] :(\"00\"+ o[k]).substr((\"\"+ o[k]).length)); &#125; return format;&#125;//调用//new Date().format(\"yyyy-MM-dd hh:mm:ss\"); 返回顶部的通用方法 1234567891011121314151617181920function backTop(btnId) &#123; var btn = document.getElementById(btnId); var d = document.documentElement; var b = document.body; window.onscroll = set; btn.style.display = \"none\"; btn.onclick = function() &#123; btn.style.display = \"none\"; window.onscroll = null; this.timer = setInterval(function() &#123; d.scrollTop -= Math.ceil((d.scrollTop + b.scrollTop) * 0.1); b.scrollTop -= Math.ceil((d.scrollTop + b.scrollTop) * 0.1); if ((d.scrollTop + b.scrollTop) == 0) clearInterval(btn.timer, window.onscroll = set); &#125;, 10); &#125;; function set() &#123; btn.style.display = (d.scrollTop + b.scrollTop &gt; 100) ? 'block': \"none\" &#125;&#125;;backTop('goTop'); 获得URL中GET参数值 1234567891011121314// 用法：如果地址是 test.htm?t1=1&amp;t2=2&amp;t3=3, 那么能取得：GET[\"t1\"], GET[\"t2\"], GET[\"t3\"]function get_get()&#123; querystr = window.location.href.split(\"?\") if(querystr[1])&#123; GETs = querystr[1].split(\"&amp;\"); GET = []; for(i=0;i&lt;GETs.length;i++)&#123; tmp_arr = GETs.split(\"=\") key=tmp_arr[0] GET[key] = tmp_arr[1] &#125; &#125; return querystr[1];&#125; 数组去重 12345678910String.prototype.unique=function()&#123; var x=this.split(/[\\r\\n]+/); var y=''; for(var i=0;i&lt;x.length;i++)&#123; if(!new RegExp(\"^\"+x.replace(/([^\\w])/ig,\"\\\\$1\")+\"$\",\"igm\").test(y))&#123; y+=x+\"\\r\\n\" &#125; &#125; return y&#125;; 按字典顺序，对每行进行数组排序 12345function SetSort()&#123; var text=K1.value.split(/[\\r\\n]/).sort().join(\"\\r\\n\");//顺序 var test=K1.value.split(/[\\r\\n]/).sort().reverse().join(\"\\r\\n\");//反序 K1.value=K1.value!=text?text:test;&#125; 字符串反序输出 123function IsReverse(text)&#123; return text.split('').reverse().join('');&#125; 金额大写转换函数 123456789101112131415161718192021222324252627282930313233343536373839404142434445464748495051525354555657585960616263646566676869707172737475//格式转换function transform(tranvalue) &#123; try &#123; var i = 1; var dw2 = new Array(\"\", \"万\", \"亿\"); //大单位 var dw1 = new Array(\"拾\", \"佰\", \"仟\"); //小单位 var dw = new Array(\"零\", \"壹\", \"贰\", \"叁\", \"肆\", \"伍\", \"陆\", \"柒\", \"捌\", \"玖\"); //整数部分用 //以下是小写转换成大写显示在合计大写的文本框中 //分离整数与小数 var source = splits(tranvalue); var num = source[0]; var dig = source[1]; //转换整数部分 var k1 = 0; //计小单位 var k2 = 0; //计大单位 var sum = 0; var str = \"\"; var len = source[0].length; //整数的长度 for (i = 1; i &lt;= len; i++) &#123; var n = source[0].charAt(len - i); //取得某个位数上的数字 var bn = 0; if (len - i - 1 &gt;= 0) &#123; bn = source[0].charAt(len - i - 1); //取得某个位数前一位上的数字 &#125; sum = sum + Number(n); if (sum != 0) &#123; str = dw[Number(n)].concat(str); //取得该数字对应的大写数字，并插入到str字符串的前面 if (n == '0') sum = 0; &#125; if (len - i - 1 &gt;= 0) &#123; //在数字范围内 if (k1 != 3) &#123; //加小单位 if (bn != 0) &#123; str = dw1[k1].concat(str); &#125; k1++; &#125; else &#123; //不加小单位，加大单位 k1 = 0; var temp = str.charAt(0); if (temp == \"万\" || temp == \"亿\") //若大单位前没有数字则舍去大单位 str = str.substr(1, str.length - 1); str = dw2[k2].concat(str); sum = 0; &#125; &#125; if (k1 == 3)&#123; //小单位到千则大单位进一 k2++; &#125; &#125; //转换小数部分 var strdig = \"\"; if (dig != \"\") &#123; var n = dig.charAt(0); if (n != 0) &#123; strdig += dw[Number(n)] + \"角\"; //加数字 &#125; var n = dig.charAt(1); if (n != 0) &#123; strdig += dw[Number(n)] + \"分\"; //加数字 &#125; &#125; str += \"元\" + strdig; &#125; catch(e) &#123; return \"0元\"; &#125; return str;&#125;//拆分整数与小数function splits(tranvalue) &#123; var value = new Array('', ''); temp = tranvalue.split(\".\"); for (var i = 0; i &lt; temp.length; i++) &#123; value = temp; &#125; return value;&#125;","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/tags/前端/"},{"name":"JS","slug":"JS","permalink":"http://lolee.cn/tags/JS/"},{"name":"资源","slug":"资源","permalink":"http://lolee.cn/tags/资源/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"正则表达式","slug":"正则表达式","date":"2016-12-20T11:21:18.000Z","updated":"2019-04-29T05:11:16.437Z","comments":true,"path":"2016/12/20/正则表达式/","link":"","permalink":"http://lolee.cn/2016/12/20/正则表达式/","excerpt":"常用的js正则表达式//正整数 /^[0-9]*[1-9][0-9]*$/; //负整数 /^-[0-9]*[1-9][0-9]*$/; //正浮点数 /^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))$/; //负浮点数 /^(-(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/;","text":"常用的js正则表达式//正整数 /^[0-9]*[1-9][0-9]*$/; //负整数 /^-[0-9]*[1-9][0-9]*$/; //正浮点数 /^(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*))$/; //负浮点数 /^(-(([0-9]+\\.[0-9]*[1-9][0-9]*)|([0-9]*[1-9][0-9]*\\.[0-9]+)|([0-9]*[1-9][0-9]*)))$/; //浮点数 /^(-?\\d+)(\\.\\d+)?$/; //email地址 /^[\\w-]+(\\.[\\w-]+)*@[\\w-]+(\\.[\\w-]+)+$/; //url地址 /^[a-zA-z]+://(\\w+(-\\w+)*)(\\.(\\w+(-\\w+)*))*(\\?\\S*)?$/; 或：^http:\\/\\/[A-Za-z0-9]+\\.[A-Za-z0-9]+[\\/=\\?%\\-&amp;_~`@[\\]\\&apos;:+!]*([^&lt;&gt;\\&quot;\\&quot;])*$ 12345678910111213141516171819202122232425262728293031323334353637383940414243444546//年/月/日（年-月-日、年.月.日）/^(19|20)\\d\\d[- /.](0[1-9]|1[012])[- /.](0[1-9]|[12][0-9]|3[01])$/;//匹配中文字符/[\\u4e00-\\u9fa5]/;//匹配帐号是否合法(字母开头，允许5-10字节，允许字母数字下划线)/^[a-zA-Z][a-zA-Z0-9_]&#123;4,9&#125;$/;//匹配空白行的正则表达式/\\n\\s*\\r/;//匹配中国邮政编码/[1-9]\\d&#123;5&#125;(?!\\d)/;//匹配身份证/\\d&#123;15&#125;|\\d&#123;18&#125;/;//匹配国内电话号码/(\\d&#123;3&#125;-|\\d&#123;4&#125;-)?(\\d&#123;8&#125;|\\d&#123;7&#125;)?/;//匹配IP地址/((2[0-4]\\d|25[0-5]|[01]?\\d\\d?)\\.)&#123;3&#125;(2[0-4]\\d|25[0-5]|[01]?\\d\\d?)/;//匹配首尾空白字符的正则表达式/^\\s*|\\s*$/;//匹配HTML标记的正则表达式&lt; (\\S*?)[^&gt;]*&gt;.*?|&lt; .*? /&gt;;//sql 语句^(select|drop|delete|create|update|insert).*$//提取信息中的网络链接(h|H)(r|R)(e|E)(f|F) *= *('|\")?(\\w|\\\\|\\/|\\.)+('|\"| *|&gt;)? //提取信息中的邮件地址\\w+([-+.]\\w+)*@\\w+([-.]\\w+)*\\.\\w+([-.]\\w+)* //提取信息中的图片链接(s|S)(r|R)(c|C) *= *('|\")?(\\w|\\\\|\\/|\\.)+('|\"| *|&gt;)? //提取信息中的 IP 地址(\\d+)\\.(\\d+)\\.(\\d+)\\.(\\d+)//取信息中的中国手机号码(86)*0*13\\d&#123;9&#125; //提取信息中的中国邮政编码[1-9]&#123;1&#125;(\\d+)&#123;5&#125; //提取信息中的浮点数（即小数）(-?\\d*)\\.?\\d+ //提取信息中的任何数字(-?\\d*)(\\.\\d+)?//电话区号^0\\d&#123;2,3&#125;$//腾讯 QQ 号^[1-9]*[1-9][0-9]*$ //帐号（字母开头，允许 5-16 字节，允许字母数字下划线）^[a-zA-Z][a-zA-Z0-9_]&#123;4,15&#125;$ //中文、英文、数字及下划线^[\\u4e00-\\u9fa5_a-zA-Z0-9]+$ 以上是常用的代码收集，没有任何技术含量，只是填坑的积累。转载请注明出处，谢谢。","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/tags/前端/"},{"name":"JS","slug":"JS","permalink":"http://lolee.cn/tags/JS/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"VueJs 中文资源汇总","slug":"vuejs中文资源","date":"2016-11-21T11:31:18.000Z","updated":"2019-04-29T11:13:44.563Z","comments":true,"path":"2016/11/21/vuejs中文资源/","link":"","permalink":"http://lolee.cn/2016/11/21/vuejs中文资源/","excerpt":"如何优雅地使用此文档 1.入门先从官网文档入手，粗略过一遍有个影响，力求回查时能找到对应的关键字或位置。 中文官网 vuejs vuejs组织 2.发出一个问题之后，不要暂时的离开电脑，如果没有把握先不要提问。","text":"如何优雅地使用此文档 1.入门先从官网文档入手，粗略过一遍有个影响，力求回查时能找到对应的关键字或位置。 中文官网 vuejs vuejs组织 2.发出一个问题之后，不要暂时的离开电脑，如果没有把握先不要提问。 3.珍惜每一次提问，感恩每一次反馈，每个人工作还是业余之外抽出的时间有限，充分准备好应有的资源之后再发问，有利于问题能够高效质量地得到解决。尤其是具备解决问题能力的人，通常时间都很宝贵。4.先搜索，再思考，最后再提问，很多人把这个顺序搞反了。5.- 如何优雅地向前辈或者高手请教技术问题？ 以上部分观点出自此文 如何优雅地使用 Stack Overflow 一. 资源教程 综合类 vuejs 英文资料 Vue中文资料总汇 Vue.js 的一些资源索引 vue资料 入门类 vue 快速入门 Vue.js 中文系列视频教程 on Laravist 英文教程 Learning Vue 1.0: Step By Step vue Learning Tutorials 社区 sf - vue标签 知乎 - vue标签 Vue.js专业中文社区 vue - issues 二. 文档 API Vue.js - API router vue-router文档 三. 组件# 1. 官方组件 Loader html loader module for webpack Router vue-spa-demo Vuex：专门为 Vue.js 应用设计的状态管理架构 vuex Ajax vue + ajax vue + ajax vue-async-data Vue-cli Simple CLI for scaffolding Vue.js projects # 2. 其它组件 UI类 VueStrap：使用 Vue.js 和纯 JavaScript 构建的 Bootstrap 组件 针对 Vue 框架移植的 We UI 框架的适配，让 mobile开发过程成为一种享受 vue bootstrap 基于Vue、Bootstrap的一套MVVM组件，简单、易用、功能强大 用VUE 和 SUI-Mobile 写了一个移动端demo - vue-sui-demo Mobile web UI based on Vue and Weui 表格 ZEE大神作品 - vue-editable 分页 vue入门－实现一个分页组件(1.0.3版本) vue(1.0.3) 分页组件 分页组件 – 命令方式，支持多个，主要靠配置 移动 Hammer.js wrapper for Vue.js vue的tap手势插件 微信 为微信Web服务量身设计 日历 ZEE大神作品 - vue-calendar Awe - 日历组件 进度条 vue 进度条 验证 Validator component for VueJS form validator for vue 0.11 Lazyload 图片的lazyload 下拉加载 Loader 【vue】vue组件化开发初体验-示例vue-loader-example学习记录 Uploader vue-file-upload vue-file-upload-component Slide vue-onlySlider-x Drag vue-drag-and-drop 四. 示例 综合示例 官方例子 - 包括Markdown编辑器，表格组件等 Vue, vue-router, Webpack 和 vue-loader 简单的vuejs例子 - 群内高手X-Roy大作 vue single page app example 使用node+vue.js实现SPA应用 Ajax A Vue.js component for creating simple AJAX forms. Webpack Vue + webpack 项目实践 基于vue.js和webpack的Chat示例 Vue.js 和 Webpack（一） Vue.js 和 Webpack（二） Vue.js 和 Webpack（三） 二哲 - 结合具体项目的webpack配置 Gulp vue-gulp-webpack单页面组件开发 Tab vue tab Shopping 基于Vue模仿蘑菇街的单页应用 其它 Ant Design 的 Vue 实现 基于vue.js重写Cnodejs.org社区的webapp 北京-giscafer - vue+webpack+node.js 价格监测应用 五. 开发工具相关 Atom atom vue 代码高亮 如何发布一个Atom的package vue-format Sublime-text Vue Syntax Highlight Webstorm webstorm添加*.vue文件支持 六. 答疑 Vue.js为什么不支持templateUrl模式 实现了vuejs组件之间的通讯问题 国内有哪些公司在用Vue.js，有什么心得 vue 支持服务器端渲染吗 Vue.js 和 Webpack 七. 源码学习 Vue.js 源码学习笔记 VUE 源码分析 vue源码分析之如何实现observer和watcher vue源码解析之一：transition Vue源码学习 Vue.js v1.0.18 八. 框架相关 尤小右 - 4-1 Vue.js-数据驱动的组件化前端开… Evan You - Diving Deep into Vue.js","categories":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}],"tags":[{"name":"VueJs","slug":"VueJs","permalink":"http://lolee.cn/tags/VueJs/"},{"name":"资源汇总","slug":"资源汇总","permalink":"http://lolee.cn/tags/资源汇总/"}],"keywords":[{"name":"前端","slug":"前端","permalink":"http://lolee.cn/categories/前端/"}]},{"title":"Sublime","slug":"sublime资源","date":"2016-10-21T11:31:18.000Z","updated":"2019-04-29T11:23:53.714Z","comments":true,"path":"2016/10/21/sublime资源/","link":"","permalink":"http://lolee.cn/2016/10/21/sublime资源/","excerpt":"Sublime资源 sublime text Download 改版过的Monokai 密码: siem 代码着色，及相关资源。 Video 大城小胖 视频介绍 happypeter 快乐的sublime编辑器 GreenBoots 前端开发工具技巧介绍—Sublime篇","text":"Sublime资源 sublime text Download 改版过的Monokai 密码: siem 代码着色，及相关资源。 Video 大城小胖 视频介绍 happypeter 快乐的sublime编辑器 GreenBoots 前端开发工具技巧介绍—Sublime篇 License 原则上是免费的，但是偶尔会提示你购买。 Plugins Emmet Git，Document原名为：Zencoding, 快速生成html,css，默认扩展快捷为tab，如果tab按钮损坏，ctrl+e替换。生成规则在： Preferences -&gt; Browser packages -&gt; Emment -&gt; emment -&gt; snippets.json中修改。@ Emmet 中文版文档 Side Bar增强的侧边栏 Docblockr增强js注释 Alignment等号对齐在Preferences -&gt; package settings -&gt; Alignment -&gt; Settings User添加冒号对齐。 { &quot;align_indent&quot;: false, &quot;alignment_chars&quot;: [&quot;=&quot;, &quot;:&quot;], &quot;alignment_space_chars&quot;: [&quot;=&quot;, &quot;:&quot;] } AutoFileName: 文件路径自动提示 gbk支持 GBK Encoding Support 检测快捷键冲突 markdownmarkdown 转为 pdf LineEndings 设置换行符 SublimeText插件列表 html美化插件 Sublime Text 新建文件的模版插件: SublimeTmpl 前端自动化神器LiveReload配合浏览器和less/sass使用方法 使用 Sublime Text 2 开发 Unity3D 项目 全栈开发必备的10款 Sublime Text 插件 Settings Font推荐使用 YaHei.Consolas.1.12.ttf，即为上图中所示字体。 Theme code style: 推荐使用这款marktheme 更换sidebar皮肤 分享一个sublime 主题 颜色配色 Preferences -&gt; Settings - User { &quot;color_scheme&quot; : &quot;Packages/Color Scheme - Default/Monokai.tmTheme&quot;, // theme &quot;draw_minimap_border&quot; : true, // 右侧缩略图边框 &quot;font_face&quot; : &quot;YaHei Consolas Hybrid&quot;, // 字体设置 &quot;font_size&quot; : 13, // 字体大小 &quot;highlight_line&quot; : true, // 当前行标亮 &quot;ignored_packages&quot; : [&quot;Toggle Css Format&quot;], // 开启vim模式 &quot;save_on_focus_lost&quot; : true // 失去焦点后保存 } 定制缩进 拼写检查 全屏模式，自由模式的定制 浏览器中预览 其它配置 Skill 按住 ctrl 键，鼠标单击就是多重选择。 键盘多重选择 根据选择文本自动添加 ‘, “”,(),[] 匹配。 搜索按钮的功能说明 (冷风贡献)： Default Keymap 1. Ctrl+L 选择整行（按住-继续选择下行） 2. Ctrl+Shift+K(shhift+del) 删除整行， ctrl + KK 从光标处删之行尾，Ctrl+K Backspace 从光标处删除至行首 3. Ctrl+Shift+D 复制光标所在整行，插入在该行之前 4. Ctrl+D 选词 （按住-继续选择下个相同的字符串，再按，可跳到相应的方法定义处 5. Ctrl+Shift+M 选择括号内的内容（按住-继续选择父括号） 6. Ctrl+/ 注释整行（如已选择内容，同“Ctrl+Shift+/”效果） 7. Ctrl + alt + / 取消注释 8. Ctrl+Shift+UP 与上行互换 ctrl + shift + up: 列模式编辑 9. Ctrl + R 跳转当前页的目标方法 10. Ctrl+K + U 大写 11. Ctrl+K + L 小写 12. 鼠标中间 列模式编辑 13. Ctrl+Shift+[] 代码折叠 14. ctrl+k ctrl+1: 折叠所有代码 15. Ctrl + K,B 打开侧边栏 16. ctrl + 回车： 光标后插入行， Ctrl+Shift+Enter 光标前插入行 17. ctrl + m: 匹配括号 18. vim mode下 查找上一个下一个的快捷键是 是* # 19. ctrl +z, y: 撤销，恢复撤销 20. alt + .: 闭合当前标签 21. Ctrl+F2: 设置书签 22. F2: 下一个书签 23. Shift+F2: 上一个书签 24. ctrl + p: 即时的文件切换 25. ctrl + shift + a: 选择标签内的内容 26. ctrl + 单击： 多行随意位置添加光标 27. alt + F3( mac: ctrl + command + g): 选择页面中所有相同的词 28. ctrl + F3: 跳转到下一个选中的词 29. Ctrl+Shift+P Set Syntax:html : 设置文件类型 30. Shift + 右键: 连续多行光标选中 (by Gary Gauh) Emmet(zencoding) Keymap 1. match_pair_outward: ctrl+,向外匹配 2. match_pair_inward: ctrl+alt+,向内匹配 3. matching_pair: ctrl+alt+j，快速匹配html标签(phpstorm: ctrl + []) 4. split_join_tag: shift+ctrl+`，快速成对修改html标签 5. remove_tag: shift+ctrl+;删除包裹的html标签(phpstorm: ctrl + shift + del) 6. increment_number_by_1: ctrl+up,数字快速增长,步长为1 7. decrement_number_by_1: ctrl+down,数字快速递减,步长为1 8. increment_number_by_01: alt+up,数字快速增长,步长为0.1 9. decrement_number_by_01: alt+down,数字快速递减,步长为0.1 10. increment_number_by_10:shift+alt+up,数字快速增长,步长为10 11. decrement_number_by_10: shift+alt+down,数字快速递减,步长为10 12. select_next_item:shift+ctrl+. 选择下一个属性 13. select_previous_item: shift+ctrl+,, 选择上一个属性 14. wrap_as_you_type: shift+ctrl+g,包裹内容 VIM Keymap sublime 支持 VIM 80% 左右的快捷键，以实际为准。 一. 移动： h,j,k,l: 左，下，上，右。 w: 下一个词的词首。W:下一个单词(不含标点)。 e:下一个词的词尾。E:不含标点。 b:上一个词的词首。B:不含标点。 &lt;&gt;: v 模式选中后进行缩进。 &gt;&gt;&lt;&lt;:向前向后缩进。 二. 跳转： %: 可以匹配{},&quot;&quot;,(),[]之间跳转。 H、M、L：直接跳转到当前屏幕的顶部、中部、底部。 #H：跳转到当前屏的第#行。 #L：跳转到当前屏的倒数第#行。 zt: 当前编辑行置为屏顶。 zz: 当前编辑行置为屏中。 zb: 当前编辑行置为屏底。 G：直接跳转到文件的底部。 gg: 跳转到文件首。 gd: 跳转到光标所在函数和变量的定义。 ():跳转到当前的行首、行尾。 {}：向上、向下跳转到最近的空行。 [{：跳转到目前区块开头。 ]}：跳转到目前区块结尾。 0: 跳转到行首。 $: 跳转到行尾。 2$: 跳转到下一行的行尾。 #：跳转到该行的第#个位置。 #G: 15G,跳转到15行。 :#：跳转到#行。 f&apos;n&apos;：跳转到下一个&quot;n&quot;字母后。 ctrl+b: 向后翻一页。 ctrl+f：向前翻一页。 ctrl+u: 向后翻半页。 ctrl+d: 向前翻半页。 ctry+e: 下滚一行。 三. 选择： 1.v: 开启可视模式。 V: 开启逐行可视模式。 2.^V: 矩形选择。 3.v3w: 选择三个字符。 4.ab：包括括号和()内的区域。 5.aB：包括括号和{}内的区域。 6.ib：括号()内的区域。 7.iB：括号{}内的区域。 8.aw：标记一个单词。 四. 编辑： 1. 新增： i: 光标前插入。 I: 在当前行首插入。 a: 光标后插入。 A: 当前行尾插入。 O: 在当前行之前插入新行。 o: 在当前行之后插入新行。 2. 修改 c(change) 为主： r: 替换光标所在处的字符。 R：替换光标所到之处的字符。 cw: 更改光标所在处的字到字尾处。 c#w: c3w 修改3个字符。 C：修改到行尾。 ci&apos;：修改配对标点符号中的文本内容。 di&apos;：删除配对标点符号中的文本内容。 yi&apos;：复制配对标点符号中的文本内容。 vi&apos;：选中配对标点符号中的文本内容。 s：替换当前一个光标所处字符。 #S：删除 # 行，并以新文本代替。 3. 删除 d(delete) 为主： D：删除到行尾。 X: 每按一次，删除光标所在位置的前面一个字符。 x: 每按一次，删除光标所在位置的后面一个字符。 #x: 删除光标所在位置后面6个字符。 d^: 删至行首。 d$: 删至行尾。 dd:(剪切)删除光标所在行。 dw: 删除一个单词/光标之后的单词剩余部分。 d4w: 删除4个word。 #dd: 从光标所在行开始删除#行。 daB: 删除{}及其内的内容。 diB: 删除{}中的内容。 n1,n2 d：将n1,n2行之间的内容删除。 4. 查找： /： 输入关键字，发现不是要找的，直接在按n，向后查找直到找到为止。 ?： 输入关键字，发现不是要找的，直接在按n，向前查找直到找到为止。 *: 在当前页向后查找同一字。 #: 在当前页向前查找同一字。 5. 复制 y(yank)为主： yw: 将光标所在之处到字尾的字符复制到缓冲区中。 #yw: 复制#个字到缓冲区。 Y：相当于yy, 复制整行。 #yy:表示复制从光标所在的该行往下数#行文字。 p: 粘贴。所有与y相关的操作必用p来结合粘贴。 ]p：粘贴到合适的缩进处。 n1,n2 co n3：复制第n1行到第n2行之间的内容到第n3行后面。 6. 大小写转换： gUU: 将当前行的字母改为大写。 guu: 将当前行的字母改为小写。 gUw: 将当前光标下的单词改为大写。 guw: 将当前光标下的单词改为小写。 a. 整篇大写: ggguG gg: 光标到文件第一个字符。 gu: 把选择范围全部小写。 G: 到文件结束。 b. 整篇小写：gggUG 7. 其它： J：当前行和下一行合并成一行。 8. 移动： n1,n2 m n3：将n1行到n2行之间的内容移至n3行下。 五.退出： 1. w filename: 保存正在编辑的文件filename 2. wq filename: 保存后退出正在编辑的文件filename 3. q：退出不保存。 六.窗口操作： 1. ctrl+w p: 在两个分割窗口之间来回切换。 2. ctrl+w j: 跳到下面的分割窗 3. ctrl+w h: 跳到左边的分割窗。 4. ctrl+w k: 跳到上面的分割窗。 5. ctrl+w l: 跳到右边的分割窗。 七.折叠： zo 將游標所在處的折疊打開。open。 zc 將游標所在處已打開的內容再度折疊起來。close。 zr 將全文的所有折疊依層次通通打開。reduce。 zm 將全文已打開的折疊依層次通通再折疊起來。more。 zR 作用和 zr 同，但會打開含巢狀折疊（折疊中又還有折疊）的所有折疊。 zM 作用和 zm 同，但對於巢狀折疊亦有作用。 zi 這是個切換，是折疊與不折疊指令間的切換。 zn 打開全文的所有折疊。fold none。 zN 這是 zn 的相對指令，回復所有的折疊。 Document 非官方文档：Unofficial Document英文版Unofficial Document中文版 sublime 配置详解 sublime 其它文档 FAQ 如何删除安装的插件？ ctr+shift+P,输入package 查找remove package 输入你要删除的package 回车，OK 百度输入造成sublime闪退(感谢leohxj提供)如果同时安装这两个软件，会造成sublime闪退，原因不详。但是测试过，是百度输入法的原因。希望能把这条信息加入到Wiki中，让更多人知道。 Guide xdebug调试 sublimetext 3.0文档 Sublime Text 3 绝对神器 SublimeText手册-tw 怎样从直接Github的repository安装Sublime Text插件 Sublime text2的ThinkPHP插件 Ubuntu 下Sublime Text 2 输入中文解决方法 如何开发Sublime Text2插件_衍生篇 用sublime构建phonegap项目 超级牛B编码王（二）：Sublime2之Zencoding快速上手 sublime text 左侧菜单美化1 在 Ubuntu 12 下安装 Sublime Text 2 Sublime Text 全程指南 Sublime Text 全程指引 by Lucida sublime 有哪些使用技巧 前端工程师手中的Sublime Text Sublime 进阶使用 SublimeText3 推荐给 Web Developer 的 Sublime Text 3 插件 Add ruanwe#163.com","categories":[{"name":"工具","slug":"工具","permalink":"http://lolee.cn/categories/工具/"}],"tags":[{"name":"Soft","slug":"Soft","permalink":"http://lolee.cn/tags/Soft/"}],"keywords":[{"name":"工具","slug":"工具","permalink":"http://lolee.cn/categories/工具/"}]}]}